{"1": ["Four score and 65 years in the past", "I won the Civil War with my beard", "Now I’m here to whup your ass", "I’ve read up on your facts", "You cure cancer with your tears?", "Well, tell me Chuck how come you never sat down and cried on your career?", "You’re a washed up has been on TV selling Total Gyms", "And you’re gonna lose this battle", "Like you lost Return of the Dragon", "I’ll rip your chest hairs out", "Put em’ in my mouth", "I’ll squash you like I squashed the South", "I never told a lie and I won’t start now", "You’re a horse with a limp I’ll put you down", "This isn’t Gettysburg, punk I’d suggest retreating", "For I invented rap music when my heart started beating", "Chuck Norris doesn’t battle, he just allow you to lose", "My raps will blow your mind like a verbal John Wilkes Booth", "I’ve got my face on the side of a mountain, you voted for John McCain", "I’ve got a bucket full of my head and I’m about to make it rain", "You block bullets with your beard? I catch em’ with my skull", "I’d make fun of Walker, Texas Ranger but I’ve never ever seen that show", "I am Chuck Fucking Norris!", "I’ve spread more blood and gore", "Than forty score of your puny Civil Wars, bitch", "I split the Union with a roundhouse kick", "I wear a black belt on the beard that I grow on my dick", "I attack sharks when I smell them bleed", "I don't go swimming", "Water just wants to be around me", "My fists make the speed of light wish that it was faster", "You may have freed the slaves", "But Chuck is everyone’s master"], "2": ["ADAM VS EVE", "BEGIN!", "This battle's gonna end like every argument does", "With you kissing my ass and begging me for a rub", "I made a map motherfucker and I'm reading it too", "Gives me specific directions how to fuck with you", "I know that you like to think you're so macho", "But you smell like ballsacks and nachos", "I work. While you and your boyfriend Steve", "Drink and play sports in a Fantasy League", "You're as sharp as a stick, that I rub on my lips", "So go ahead take a shot, I'm sure that you'll miss", "Like the laundry, the toilet, the grocery list", "If you'd stop fucking up I wouldn't have to get pissed", "My life was fine 'till you had to come along and wreck it", "Could you please just shut your face for ten seconds?", "You cry about everything, but can't decide what you want", "\"I'm hungry\", \"I'm fat\", \"I'm cold\", \"I'm hot\"", "You call it complex, but yo I'd call you a mess", "You take two hours to cum, three more to get dressed!", "You got a lotion for this? Got a cream for that?", "Got any perfume that smells like get the fuck off my back?", "When things are good they're great, and it's like I'm dreamin'", "Until your junk starts bleedin' and you turn to a demon", "It ain't summer Eve, don't try to play me like a douche", "You wanna bite on my fruit well you can swallow the truth!", "Don't. even. bring up swallow", "The first man on Earth ain't a tough act to follow", "One pump chump and you're hung like a weasel", "Ditch the fig leaf, get yourself a pine needle", "You want alone time? Have it! In fact", "Suck your own dick, and shave your own back", "That apple's the best thing I bit so far", "Now I see how much of a dick you are", "I wasn't listening, are you still flapping those lips?", "I was just thinking, yo did I give up a rib for this?", "Woman, I just don't know what your problem is", "All I know is you're acting like a colossal bitch!", "Adam:", "I'm sorry", "Eve:", "...I'm sorry, too", "Adam: ", "Alright, nice!", "Eve:", "Don't even think about it!", "Adam:", "Okay, that's fine, we can eat", "WHO WON? WHO'S NEXT? YOU DECIDE!", "EPIC (OH YEAH) RAP BATTLES OF HISTORY!"], "3": ["ALEXANDER THE GREAT!", "VERSUS!", "IVAN THE TERRIBLE!", "BEGIN!", "Look alive, crème de la Kremlin's arriving", "Try to serve Ivan? No surviving", "You're a land rover, I'm a land expander", "Here to hand you your first loss, Alexander", "I'll school you like Aristotle", "Smack you harder than you hit that bottle", "You're nothing but an overrated lush, I'll crush ya", "I'm the first Tsar of all of Russia", "You're an asshole with an anastole", "I'm heaven sent, divine and holy", "So don't even try to approach the God", "Or you'll get a huge sack like Novgorod", "Hey fella, swell diss", "But now you got the Panhellenist from Pella hella pissed", "Stepping up's foolish as well as useless", "Little Vasilyevich, let me spell out the list", "I brought foes to their knees in Phoenicia", "Breezed through Gaza to Giza", "Had the Balkans, Persia, Syria, Iraq and Pakistan", "In my expansion pack", "While you died in the middle of a game of chess", "You got vodka bars, flavorless", "And what I'm 'bout to spit will be the craziest", "So go fix me a drink so I can stay refreshed", "Kudos! Greek for the glory I got", "From winning every single war that I fought", "So this will be straightforward, I'll take up this sword that I brought", "And slice you in half like the Gordian knot", "And I'll soar to the top like the eagle whose feather I would sport in the helmet that I wore", "As I swatted my many enemies, shattered 'em like a porcelain pot", "And they'd be praying for the torture to stop", "But I would leave 'em contorted and they'd be screaming and roaring", "Until their vocal chords were torn up and shot", "And I would holler Bucephalus!", "Hop on my horsey and trot", "I win Ivan, I vanquish", "I'm an immortal, you're not", "Enough! I don't stand a chance against your skills", "На здоровье - A drink to your victory!", "Yes, I will!", "It seems no one can defeat me", "I weep, it's all so easy... ooh", "What's wrong?", "I feel a bit... queasy", "Ha! You've been poisoned!", "Oh, the pain is unbearable!", "My stomach's riddled with holes!", "Ugh, I'm terrible", "There's no great who could defeat this Russian", "Psst, what about a flute busting Prussian?", "Old Fritz!", "Old Fritz!", "Old Fritz!", "Old Fritz!", "Old Fritz!", "Old Fritz!", "Old Fritz!", "Old Fritz!", "I'm Frederick the Great, out the gate first servant of state", "Oblique attack tactics ain't exactly straight", "I've got creative talents and battle malice", "Hard as steel on the field, genteel in the palace", "Russia's fucked up, but no wonder why", "With your tundras and taigas and bears, oh my!", "I would pay a guy to tear out my eyes", "If I had to look at your troll face every night", "Now bring me my chair", "I'm weary from tearing you a new derrière from here to Red Square", "Fought a Seven Years' War, I ain't scared of a Tsar", "'Cause beating you only took me twelve bars", "Ohhh, what a humiliating defeat!", "I know when I am beat, so of course, take a seat", "I'd keep ripping you to shreds, but I'll take a break instead", "And just rest my little head", "Why don't you drop dead, Fred?", "Hmm, my expectations were a lot higher", "But at least I saved the rubles on the garrote wire", "It's another great day and another great victory", "'Cause no great can beat me", "What about me?", "Pompey! Yeah!", "Macedonians, Prussians and Romans", "Those aren't worthy opponents", "It takes a Russian to take down a Russian", "I'm Cath, I'm a cat, you're a rodent", "How are you the head of our state", "When the state of your head  was such a crazy one?", "Such sick shit going through your brain", "That you stuck a spike through your own son (Oooh)", "You're unbalanced like I unbalanced the European powers with the wars I waged", "I brought the Russian empire straight out of the olden days and right into the golden age", "I'm the boss bitch that you just can't meddle with", "This whole battle's like Alaska cause I settled it", "Hmmm, what a beautiful Queen to beat me in a battle", "Accept this gift, Your Highness", "I hear you enjoy the saddle", "That horse story is a pile of shit", "Though I do keep 'em chomping at the bit", "But you're never gonna get it, nyet", "Couldn't spin in my chamber if this were Russian roulette", "I'm picking up where Peter the Great left off", "Bringing sexy back to House Romanov", "So don't call me Queen, I'm far more great", "Empress to Tsar 8, bitch", "Checkmate", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!", "EPIC!", "RAP BATTLES OF HISTORY!"], "4": ["Cowabunga, dude, so let's get it on", "Reptiles against the fathers of the Renaissance", "We got the classical technique", "To kick these three-toed freaks back under the street", "I take a turtle and I turn him into mincemeat", "You don't really wanna step to da Vinci", "I love the ladies, I like to keep it mellow", "So let me pass the mic to my man, Donatello.", "Hard shell, but you're gross in the middle", "Wouldn't wanna touch you with a six-foot chisel", "Born in goop, raised in poop", "I slice through a group of ninjas like fruit - oops!", "Yo, Raphael, and I came to flow", "Deemed dope by the Pope and I boned til I croaked", "I'm an emcee Shredder but I get the feeling", "I should pass it up to my man on the ceiling!", "Oh, Michelangelo, and I'm a giant!", "I made David, but I'll slay you like Goliath!", "I'm a rap God, and you can't quite touch me!", "This battle's your Last Judgement, trust me!", "We drop science!", "We got the mathematics!", "The architects of rebirth are rap addicts!", "You beat the Foot, but it won't go well", "When you catch an Italian boot to the half shell!", "The wisdom of our master (Splinter!)", "Taught us not to rush to violence (Splinter!)", "But our master (Master Splinter!)", "Ain't here, dudes! (Hee-yah!)!", "I don't think you wanna mess with my katana blade!", "Get back in your floppy helicopter, fly away!", "I can Bebop and steadyrock a mic, sucka!", "I'm a pristine Sistine nun chucka!", "Oh hi, I'm a cool but rude guy", "Put you back in school with the tip of my two sai", "Uh, Dona-tell me who you are again dude", "Cause I don't Gattamelata clue what you do", "That's because you mutants are too immature", "You wouldn't know genius if it pissed in your sewer", "We got the talent, and the mind, and the rhymes so sweet", "We're like your NES game, because we can't be beat!", "Go ahead and hate cause we'll just skate on by", "You guys draw more dicks than New York Pride", "We're the TMNT, drop kicking Italy (Go, Go, Go, Go, Go)", "Chowing on your tower made of pizza, save a slice for me!"], "5": ["ASH KETCHUM!", "VERSUS!", "CHARLES DARWIN!", "BEGIN!", "Darwin wants to battle? Doesn't seem like a fight", "But this should be fun! I've yet to catch a ghost type", "Got the highest speed stat, drop rhymes lightning fast", "Open my pockets and go (Charizard) on your ass", "Cause I'm Ash! And that's A-to-the-Shush!", "I don't care how many beetles and butterflies you squooshed", "Your earthworms can’t beat these magical beasties", "Your shit-talking mouth is the Origin of Feces", "You've got candy raps, Reese’s Pieces", "In this ecosystem, I’m the dominant species", "When it’s time to train, I turn to Pikachu. (Pika!)", "But when I need a weak verse, I choose you", "Hello there, welcome to a world called Earth", "Where actual minds do groundbreaking work", "If you’re looking for the fittest, I’m the natural selection", "You’re so ineffective, you couldn’t even turn eleven", "What you spit’s just not hard-hitting enough", "It’s kid stuff, you’re soft like a Jigglypuff", "You got no Game Boy, so you’ll get the broom quick", "The real Ash packs a much bigger BOOMSTICK", "I’m a masterful naturalist", "What I've glimpsed will outclass all the crap on your laughable list", "My research reversed the first words of the Church", "You measure your worth by the sales of your merch!", "Yo, um… real quick", "This dude spent eight years studying barnacle dick", "Kick it! You think I’m impressed by your boat trip? Please", "You’re the most annoying thing on a Beagle since fleas", "You’re a glitchy old man best left out at sea", "Set sail and Galápago-suck on these", "Look, Mighty Morphin Michael Vick", "Your animated slave fights make me sick", "When I battle a foe from so simple a beginning", "I’m not Charles Sheen but I am Dar-winning", "Man, if that’s true, then nature is cruel", "Cause the only thing you’re winning is your cousin’s gene pool", "You lost three children while they were still small", "TB and scarlet fever, gotta catch ‘em all", "It took millions of years for mankind to evolve", "Now they’re hunched over cellphones playing with your balls", "And it was hard losing my daughters and their brother", "As hard as the wood that Oak gave your mother", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!", "EPIC… RAP BATTLES OF HISTORY!"], "6": ["BABE RUTH!", "VS", "LANCE ARMSTRONG!", "BEGIN!", "Before I let loose with this ruthless aggression", "I'll let you be the second fat woman hearing my confession", "I admit it, I did what I had to do to win!", "I'm an athlete, you're a specimen of sin!", "With your drinking and smoking and choking down food", "I know French dudes with better manners than you!", "So swing, batter batter, show me what a fatter rapper can do,", "I beat cancer, I can sure as hell crack you!", "You lived strong, beat cancer, congratulations!", "Now I'll drop your ass faster than your own foundation", "Third base with an Olsen twin, that's the sin, face it!", "She's just a little girl, what'd you give her, a bracelet?", "Whole nation knows you ride too tight in the crotch!", "You're as boring as your Tour de France is to watch", "So come on, little buddy, don't look so pissed!", "With all that blood and attitude, you're like a menstrual cyclist!", "You set records before black men could compete, are you kidding me?", "That's like having a pasta contest without Italy!", "You're an orphan who found his way to fortune and fame", "Just think what you could've done if you would've actually trained!", "I'm the pinnacle of physical condition while you dip your stick in prostitutes and called it foul tippin'", "Are you trippin'?", "You'll be nothing but a skeleton", "Messing with the fellow in yellow who will be pedaling like hell up in the Peloton!", "It's the bottom of the ninth against the Texan in a bathing suit", "Filled with more artificial ingredients than a Baby Ruth", "It may be way too soon but I'm calling my shot", "And I'm not talking about those Italian syringes you brought!", "The Sultan of Swat will knock you right outta the park", "And round the bases to the sound of up-roaring applause", "While you hang your head in shame and disgrace because", "You got lost and forgot what real sportsmanship was!", "You look tired, kid, you've got Sheryl crows feet eyes", "Pedal home to France, and maybe bring me back some fries!", "Cause if you step to Ruth on the mic, I'll fan your fancy bike and all", "Yerr out, with three strikes, and just one ball!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP BATTLES *CLAP* *CLAP* *CLAP* *CLAP* *CLAP* OF HISTORY!"], "7": ["MITT ROMNEY!", "VERSUS", "BARACK OBAMA!", "BEGIN!", "I'm not gonna let this battle be dictated by facts", "I'm rich, I got fat stacks and Super PACs", "We all know what went down in that 2008 election", "You're a decent politician with a winning complexion", "You're all Barack and no bite", "Been no change and we're all still hoping", "That you'll shut your mouth", "But like Guantanamo Bay they're both open", "You're from the windy city", "Where you're looking pretty with your blowhards", "But come January, you'll be left evicted and with no job", "Raw rhymes stronger than my jaw line when I spit a phrase", "Knocking you harder than front doors in my old mission days", "You see this silver spoon?", "This dug Mass out of debt", "Took you four years to drop unemployment down below 8%", "You feel that Barry? You're old news, everyone's having doubts", "And your rhymes are as weak as this economy that you've done nothing about", "Call me a vicious businessman cause Romney's stealing this race", "I'll go Bain Capital on your donkey ass, restructure your face", "They say your father was a great man, you must be what's left", "Need to stop hatin' on gays, let 'em teach you how to dress", "You've got the momma jeans, and a Mister Fantastic face", "So rich and white it's like I'm running against a cheesecake!", "Republicans need a puppet and you fit", "Got their hands so far up your rear, call you Mitt", "I'm the head of state, you're like a head of cabbage", "'Bout to get smacked by my stimulus package", "You're a bad man with no chance, you can't even touch me", "I got four more years (two termz!) in the White House, just trust me", "I hoped you saved your best rhymes for the second half", "Cause right now, I'm 47% through kicking your ass", "Whatever, that 40% thing got you real mad", "What, did it remind you how many decent parents you had?", "Uh, look, I respect all religions, uh, but it might get crazy", "If the White House has a first, second, and a third lady!", "Ha, don't bring up wives, man, what are you doing?", "You got hitched to the female version of Patrick Ewing!", "Uh, let me be clear, uh, don't get it twisted", "We'll see how pretty your face is after my fist has kissed it", "Ahhuuhhhaa", "You're a stuttering communist", "Oh yeah? Well you're stupid", "You're stupid", "Nuh-uh", "Errggg", "Errggg", "Cawwww!", "By the power invested in me by this giant bald bird", "The President shall not be the shiniest of two turds!", "You! I wanna like you! Don't talk about change, just do it!", "I fought for what was on my brain until a bullet went through it!", "And you, moneybags, you're a pancake, you're flip-floppity", "It's a country, not a company you can play like Monopoly!", "I'll properly reach across the aisle and bitch-smack you as equals!", "\"Of the people, by the people, for the people\"", "Eagle!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC", "(Cawwww!)", "RAP BATTLES OF HISTORY!"], "8": ["SHERLOCK HOLMES!", "VS", "BATMAN!", "BEGIN!", "Nice hat, dork, you look like a duck", "I had Alfred read your books, he told me they suck", "I'll crush your British nuts until they're bangers and mash", "I've seen better detective work in Tango & Cash", "You chump, I kick punks like you off the streets", "While you and Velma here are solving Scooby Doo mysteries", "Nothing makes me laugh, but I bet your raps can", "So bring it on, bitch, I'm Batman!", "I once met a rich fellow who smelled of guano and pain(Holmes explain)", "I deduce this deuce stain as Bruce Wayne (The billionaire?)", "Yes, his wealth would allow this adversary of ours", "To afford the toys he needs (Since he has no superpowers!)", "You want a battle, bat? Bring it then (I heard he has a British butler)", "Good! Then he'll be used to getting served by Englishmen!", "You're a wack vigilante black pantied spud with no skill", "My sidekick's a doctor (Because his flows are so ill!)", "Shut up, nerds, I serve justice, so eat it", "My sidekick only comes around...", "When he's needed!", "Boy Wonder make you wonder how your ass got killed", "Bite harder than those hounds down in Baskerville", "I'll blast you with that bat-whack-rap repellant", "Rappel a building, snatch a villain, then by dinner be chilling", "Gotta secret about your homegirl Irene Adler", "Took her back to my nest, to bam pow kersplat her", "I'll shatter that fiddle with a chop of the hand!", "Holy Conan Doyle, let's get 'em! Aw god damn!", "You're not smart, you're selfish, you endanger everyone's life", "Why don't you let your boyfriend here go home to his wife?", "Nobody likes you, not your brother, not your partner, not Scotland Yard!", "You'll die alone with no friends except that needle in your arm!", "This mustn't register on an emotional level...", "First, exploit childhood tragedy...then gesture with pipe...", "Watson finishes punchline...next, acknowledge compliment", "Conclude with killer catchphrase....", "I believe your parent's homicide is why you mask your face", "You're shamed and traumatized and haunted by the vast disgrace", "Of watching like a passive waste as momma died and daddy was dispatched with haste! (Holmes, you've cracked the case!)", "You're a bat shit crazy basket case!", "(Bloody good rhymes!) I've got tonnes!", "Dissing these dynamic douchebags was elementary, my dear Watson (OHHHHHHH!)", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC! (NANANANANANANANA) RAP BATTLES OF HISTORY!"], "9": ["BEN FRANKLIN!", "VS!", "BILLY MAYS!", "BEGIN!", "I'm big Ben Franklin and this shan't be pretty", "Let me instruct you how we battle in the city of Philly", "You couldn't sell Rick James a bag of crack, you're out of practice", "My victory more certain than death or taxes", "Fact is you're a hack, wack QVC joke", "You peddle soap that cleans bird shit from my windows", "I'll craft a lyrical coffin and then spit the nails in", "Call me Arthur Miller son, cause it's death of a salesman", "Hi Billy Mays here with a special TV offer", "Watch me crush this bald fat foppish founding father", "I'll take my awesome auger and sow your quaker oats", "I'll shoot your rhymes down like a regiment of red coats", "I'm lord of the pitch and leader in home sales", "You're just a lumpy pumpkin who invented the mail", "Benny's got kite'n key but you're in for a shock", "When I strike you with bolts from my lightning rod cock", "Stop I protest these intolerable raps", "It takes just one easy payment for me to whoop your ass", "Cause I'm mint I'm money I'm an educated gentleman", "So join or die Bill cause it's all about the Benjamin", "But wait there's more!", "Is there anyone out there who can finish this battle?", "Anyone...?", "Anyone...?", "I can", "You following me camera guy? Cause it's about to get furious", "You're gonna love my nuts until you're bi-focal-curious", "Your boy George chopped down trees; you couldn't break a piece of balsa", "Slap chop your face, make a double chin salsa", "Your style's so broke they call you Poor Richard", "It's bad enough I got to see you every time I tip a stripper", "Vince against a founding father is just too bad", "Cause after this America is gonna lose a Dad", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEEEEEEEEEEEEEEE-picrapbattlesofhistory.."], "10": ["AL CAPONE!", "VS", "BLACKBEARD!", "BEGIN!", "I come strapped with six pistols and a dagger", "Walk under the black flag with a scallywag swagger", "Ain't no parrot on my shoulder and no rings in my ear", "I'm an irate pirate, real swashbuckling buccaneer", "Beef with me? Please! I'm the high seas Caesar", "My cold heart is many degrees beneath the deep freezer", "You're an obese greasy sleaze squeezing a diseased peter", "That no skeezer would touch if she had fifty foot tweezers", "Don't start a war with me, you're not hardcore", "I'll pimp-slap those face scars of yours, port and starboard", "You spent time in Alcatraz, I'm sure you were fine", "If you dropped the soap as little as you drop dope rhymes", "I'm a busy man, Captain Crunch, I'll make this quick", "I'm ruining pirates faster than Johnny Depp did", "I had syphilis, yeah, well you're a huge dick", "With a scurvy ridden ship filled with bilge rat pricks", "I run an intricate criminal syndicate, so show respect", "Or get that tongue ripped out your neck and shoved right up your poop deck", "Slappin' bitch-ass teaches back since I was 14", "You ain't a tough guy, my kids dress up like you for Halloween", "I'll use that fuse in your hat to light up you and your buddies", "And burn your sailboat down and collect the insurance money", "Then maybe they'll find your bloated body dead and washed up on the beach", "This is Capone rapping and I'm capping this captain, Capisce?", "The Valentine massacre brought you condemnation", "But I'm gonna sink you faster than your income tax evasion", "When I toss you overboard like a mob abomination", "So prepare to learn the Davy Jones Locker combination", "Forty cannon on the Queen Anne, your gang can't stop it", "I'll pilfer all your rum and sell it back at a profit", "Cause I'm a criminal legend with a badass name", "You're a fat thug with an STD in his brain", "C'mon, they chopped your head off and they hung it from a rope", "The only legend you left was your prohibition on soap", "I mean, that rat nest beard's trapped so many crumbs", "This bum could get marooned and still eat lunch for a month", "I'm the emcee assassin, slash like Edward Kenway", "Rap so hard call me Al... dente", "Take your little sloop John B and go home", "Tell South Carolina Blackbeard got Capwned", "WHO WON!", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP", "(EPIC RAP, EPIC RAP, EPIC RAP)", "BATTLES OF HISTORY!"], "11": ["BOB ROSS", "VERSUS", "PABLO PICASSO", "BEGIN", "I am the greatest, the modern art Muhammad Ali", "I melt faces, call me MC Dali", "Your whole body of work is a fluffy mountain of crap", "You're the PBS version of Nickelback", "But I think you must be a genius cause with zero training", "You made millions teaching people how to suck at painting", "Why don't you go back home and beat your brush, you chump!", "I could make better art with my wiener, Lump!", "I'm so glad you could join me today", "So I could teach you how to feel some joy when you paint", "You're moody little genius, always so serious", "I know, you must be on your Blue Period", "Your work is melancholic, I'm painting happy little trees", "Call me Jackson Pollock, because I splatter MCs", "With the voice that soothes, so let's do this", "I’ll twist you up like you're a Rubik’s cubist", "Don't use that word like you know what it is", "You painted thirty thousand pictures of bushes and sticks", "Does your audience know that you stole your whole show?", "You just ripped off your teacher, and added an afro!", "My name is Pablo Diego José Francisco de Paula", "Juan Nepomuceno María de los Remedios Cipriano", "De la Santísima Trinidad Ruiz y Picasso", "Back...to...you...Bob", "Well Bob is dropping bombs like this is Guernica", "I served twenty years, air force, United States of America", "My technique will make your mistress weep", "Put her to sleep, elbow drop her dreams, I go deep", "And I keep it mellow like some cadmium yellow", "I'm a bright like titanium white kind of fellow", "Don't believe in mistakes unless you step to me", "Yo Pablo, you just got your happy little ass beat", "WHO WON?!", "WHO'S NEXT?!", "YOU DECIDE!!!", "Here’s a Epic… here’s a little Rap… BATTLE OF HISTORY!"], "12": ["Get on the track and wreck this shit", "Disrespect this shit, chin check the bitch", "If they want it, they got it", "I'm wrecking the topics, defying your logic", "Fold the game, it's in my pocket", "Try to stop it, if I had to curve it, y'all", "I'm wrecking y'all, just like a wrecking ball", "No Miley though, kick that, just keep twerking", "If you see me on the mic, you know that I'm working", "I get it hot, bringing the steam in", "What you know about what I'm doing? You feening", "You're dreaming if you think that you're taking me down", "Spit another rhyme you bastards, I'm straight getting crowned", "Anytime you wanna step, disrespect and anybody want it you can bet that I got it, garaunteed, you best believe, I take everything you need to breathe, ugh (Ugh!)", "Your lungs are earth, Since my birth I, plagued you when I rehearse, I mean rehearsing", "Played with curses, you right back now when I spit these verses", "I hit you fast to dashing, smashing, clashing, you want it?", "Smashing in your head, lashing out against me but I'm stepping up", "You're out of luck, I still don't give a fuck", "You've got a coaster at the cafe, cause I'm cooking, good looking", "You know that you've just been mistooken", "If you think you're taking me down, you're getting raped like this mic is", "Right here and now, I break it down", "Like scientists, Mark Ruffalo in this bitch", "You want to see me right now? I'll be in the streets", "I do it like Banner, cause I keep it smart", "But I keep it like The Hulk cause I'll rip you apart (Oh my God!)"], "13": ["BRUCE BANNER!", "VERSUS!", "BRUCE JENNER!", "BEGIN!", "I'll school you in this battle of the baddest Bruce", "With your He-Man haircut and your Daisy Dukes", "I hear you're good at running, you're just like the Flash", "Especially in the hundred meter ditch your wife dash", "I'm an ace in the lab, acid, base, and treble", "So let me break you down on a molecular level", "You turned one gold medal to a lifetime of green", "The most overrated athlete anyone's ever seen", "You need to carry fatherhood across the finish line (AAGHH)", "Kept up with the Kardashians, but left some kids behind", "Run along you'll thank me, 'cause I'm getting kind of cranky", "And trust me, you wouldn't like me when I'm angry", "I think you're in your element when you're behaving badly", "Honestly, you're kinda Boron when you're happy", "I'll lap and pass your ass ten different ways", "Decathlon athlete, blast through you like some gamma rays", "The truth is, there’s no truce between the Bruces", "You’re a drifter being useless, I’m a winner, no excuses (uh)", "Beautiful women all up on my jock", "I got a home gym, check me on the cereal box, doc", "You big green freak, don’t try to flex", "If it wasn’t for your cousin, you’d never have sex (oh!)", "You’re so strong when you get mad", "Too bad you can’t go back and protect your mom from your dad", "Ahhh! That painted face don't give you class", "Just one more thing Bruce do for cash", "Best thing you make? Kylie ass", "She eighteen? Hulk smash!", "That’s my teenage daughter, man, I have to forbid this", "I’ll put a javelin through your jolly green discus", "Kylie not the type of girl I'm gonna let you smash on", "You’ll get the medal without the decathlon", "(Ahh!) Hulk is Hulk, no identify as man", "Me thinks Cait might understand", "No gender issue, this Jenner issue", "Just you being you is enough to diss you", "Look, I understand that you hate yourself (Huh?)", "But you don’t need to blame yourself", "You a tiger, stop trying to tame yourself", "You gotta be big enough to contain yourself", "And get hit with a little forgiveness", "Be green, that ain’t none of my business", "But if you think you’re looking good in those torn-ass clothes", "You’re lyin', which means you need a new wardrobe", "Oh! The vision of those shorts kinda scarred me", "What, you just rage at a Barney-themed party?", "That’s probably not something you seen as a child", "Not one day did you see your daddy smile", "Hulk not strong enough to deal with denial", "Laying you down easy, that’s kitchen tile (Uh!)", "Examine this under your microscope", "You got no neck, but you still fucking choked", "After battling me, you’re gonna always be pissed", "So the Hulk will stay forever, neither Bruce will exist", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!", "EPIC RAP! BATTLES! OF HISTORY!"], "14": ["CLINT EASTWOOD! VS BRUCE LEE!", "BEGIN!", "I've got the baddest fists of fury that the world ever saw", "Defeat whole karate schools and motherfuckers with claws", "How can you talk more shit, with my fist in yo jaw?", "Don't need words to serve ya, I'mma just say WAAAT-AWWW!", "Your movies, they bore us, they're slow as a tortoise", "I'm the king of nunchucks, I fucked up Chuck Norris", "I invented Jeet Kune Do, so taste my slipper shoe", "Here's my two-finger push up, Kung F U!", "You scream like a girl and got moves like Jagger", "But I'll rip through your ass faster than a Pupu Platter", "You're in the gym too much Ringo, perfecting kicks", "You should spend more time matching your voice up to your lips", "You don't belong in a fight, you belong in a sweatshop", "So go ahead, make my iPod", "Those little dances you do don't threaten me, Bruce", "Fuck you dude, I even squint better than you", "I beat the good and the bad, you must be the ugly", "I would mess up yo face, but your mama did it for me", "Go tug your pistol for a fistful of yo Million Dollar Babies", "You were cool in the 80's, maybe, but now you're just crazy", "A man who argues with people who aren't even there", "Is more fit to rap against this fucking chair!", "Do ya feel lucky, punk? That's what I'm askin'", "You can't be too tough, you got killed by an Aspirin", "And your one-inch punch? Same size as your pecker", "Leave the rappin' to me, stick to Chinese Checkers", "I'd beat you in round two but that'd be unbelievable", "No one in your family ever lives to see a sequel", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "15": ["CLEOPATRA! VS MARILYN MONROE!", "BEGIN!", "Whose rap flow's the dopest? Marilyn Monroe's is", "Overthrow pharaohs who oppose me like Moses", "You could never kick my ass, so kiss my clitoris", "This ugly hag and KassemG got matching noses", "You better hold more than your skirt, miss please", "I'm the Queen of the Nile, so just bow down to me", "Plus you've got so much experience down on your knees", "Married a writer, but I don't even think you can read", "You'll sleep with any ugly dude who says he likes it hot", "Even Joe DiMaggio took a swing in your batter's box", "I'm a descendant of the Gods, don't anger me trick", "You'll lose this battle like your bout with barbiturates", "I had some ugly boys but you're forgettin' the others", "Marlon Brando and the Kennedy's, while you fuck your own brothers", "You think you're so chic up in your fancy palace", "Gettin' Lo on Mark Antony, tossing Caesar's salad", "You wear too much eyeliner for anyone to adore you", "You might as well be working the door at Sephora", "I got an ass that won't quit", "You had an asp and got bit, on the tit", "Somebody roll this bitch back up in a carpet", "You still got no children after your third marriage", "You lost so many babies we should call you Miss Carriage", "You've got an hourglass figure, but that's about it", "A candle in the wind that can't act for shit", "Translate this into hieroglyphs", "Your sandy vagina has a 7-year itch", "My best friends are diamonds! You can't beat me, quit trippin'", "Step off and walk your ass home like an Egyptian", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "16": ["CAPTAIN KIRK!", "VERSUS!", "CHRISTOPHER COLUMBUS!", "BEGIN!", "Arrivederci I'mma leave before this battle begins", "Cause we both know in the end which of these captains gonna win", "I’ll show you how a real explorer handles a situation", "I’ll beat you so bad they’ll feel it in the next generation", "So bring it on! I’ll whip you like a Klingon", "My rhymes will burrow in your ears like The Wrath of Khan", "I’ve got a neck chop for Spock I’ll put my sword through Sulu", "Check into a Priceline Hotel and watch your fat ass on Hulu", "I’m the enterprising Captain James Tiberius Kirk", "Representing Riverside Iowa, planet Earth", "I hear you call yourself an explorer", "But I’m just not having it", "You discovered a new world that was already inhabited", "Why don’t you boldly go someplace you’ve never gone before like India", "Or any destination you actually set sail for", "You spaghetti eating fuck", "How’s your spice rack doing?", "I’ll be chilling in my spaceship", "Have fun canoeing", "You know, rapping against you, it’s not even fun", "It’s like somebody set your brains on stun", "I am the fabric of history, you are a fictional stain", "I’ll stick a flag up your ass and claim you for Spain!", "Mr. Spock, beam me back to 1492 so I can beat this man like it’s my job", "We’ll see how Isabella likes my Captain’s log", "It’s Kobayashi for you, there’s no way you could win", "When your weak crew sees me approaching", "They’ll be like, dammit it’s Jim", "I’ll double-fist-punch you, you slave making bitch", "Now, take your genocidal ass off of my bridge", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEEEEEEEEEEEEEEEEEEPICRRRRRRRRRAP BATTLES OF HISTORY!"], "17": ["Adolf Hitler:", "Vader… This is your last chance… Battle me… or die…", "DARTH VADER!", "VERSUS!", "ADOLF HITLER!", "BEGIN!", "Screw you, you big black cunt!", "I'll kick your balls and your face! A war on two fronts!", "The Führer will crush the Dark Side! Like a rap Apartheid!", "I put the germ in the Germany! I'm sick on this mic!", "I beat you twice, you sellout, now you bow down to Mickey Mouse", "You call yourself a Dark Lord? You couldn't even conquer Space Mountain!", "You're just a sad asthmatic robot freak who needs some loving", "Well I baked you something, here, pop into my oven!", "Let me paint you a picture, son", "Potrait of a bitch after World War One", "You were stirring up the fears of the German people", "Telling the world that the Jews are evil", "You wrote a little book, got'em fired up", "Had a Beer Hall Putsch, got'em fired up", "When your bunker started getting fired up", "You put a gun in your mouth and fired up!", "You dumb motherfucker, didn't Napoleon let you know?", "When you conquer Russia, better pack some fucking winter clothes!", "While you're fighting off Valkyrie", "I got a million clones, they die for me", "My bounty hunters ride for me", "Yo homeboy, finish this rhyme for me!", "They call me Boba Fett, you wanna mess with me?", "I'll put my balls in your mouth like boba tea", "I got a jetpack, yo, you know I steal the show!", "Cause when I rock the microphone I-", "Oh, Sieg Hell No!", "You're not going to cheat me, Mister Sunglasses All the Time!", "I'll take you and your new boyfriend Goofy and all your spermy soldier guys!", "And throw you in a butthole in the sand!", "I am Adolf!… Hitler...", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEPIC RAP! BATTLES! OF HISTORY!"], "18": ["I am Adolf Hitler! Commander of the Third Reich", "Little known fact: also dope on the mic", "You are Vader, with your little boots and cape", "And helmet to cover up that burnt-ass face", "You have the force to move objects, I am a force truly evil", "Even went back in time and turned you wack in the prequel", "'Cause look at you, you’re not even a real person", "I preferred you in *Spaceballs*, the Rick Moranis version", "You can’t rhyme against the dark side of the Force, why even bother?", "So many dudes been with your mom, who even knows if I’m your father?", "You’re a pissed off little prick with a Napoleon dick", "You call that a mustache? I call that Dirty Sanchez on your lip", "You bitch, let me remind you who you’re messing with", "Everything that you did, I’m the motherfucker who invented it", "I’m the original Dark Lord, you’re like the Sorcerer’s Apprentice", "My Stormtroopers make yours look like someone took a piece of shit and cloned it", "You stink, Vader, your style smells something sour", "You need to wash up, dawg, here, step in my shower", "I’ll turn all your friends against you, just my speeches breed haters", "What’s your lightsaber vs a clan of all your white neighbors?", "Suck my robot balls", "Now, take a step back and let me freeze yours off", "A little carbonite bath for your goose-stepping ass", "We’ll call my homeboy in Israel, see who got the last laugh"], "19": ["ADOLF HITLER!", "VERSUS!", "Who are you?", "DARTH VADER!", "BEGIN!", "Someone who loathes you, bitch, now stand up and rhyme", "I only thawed you out so I could beat your ass a second time", "Roar like Chewbacca", "The voice of Mufasa", "I'm on the leader of your limp dicked Luftwaffe", "I strike back hard against a Nazi", "Brain toss your ass in the air, Yahtzee!", "Ask Indiana Jones who the fuck I am", "I spit sick shit so focused I break your concentration camp", "I'm a certified Sith Lord, you runt", "So suck on deez...", "Uh, deez what, sir?", "Deez robot nuts!", "I'm gonna enjoy watching you die", "So let me do it with my own eyes", "You look stressed, Vader, you appear to be in pain", "You need to take a vacation, here, take a trip on my train", "I mean you, leading an army of white men? Disgraceful!", "Even your mic skills still aren't fully operational", "You got one bitch pregnant then gave in to the hate", "Now you're 6'6 and black but can't get a date", "Lightsaber? You need a Life Saver", "Use some of your force to fix your fucking respirator", "You think you're powerful with your finger neck pinches?", "You couldn't even get your own son into the family business!", "Everything you do is an epic fail", "Now stand at attention and Sieg fucking Heil!", "What's wrong Ani? Can't take anymore?", "Not surprising coming from the Emperor's whore", "Yeah! Ya take that!", "What's the matter?", "Where is the DJ? Why are you laughing?", "Because you're standing over the Rancor Pit", "AAAAAHHHH-I-AM-ADOLF-HITLER!", "Who won?", "Who's next?", "You decide!", "EPIC! (Part 2!) RAP BATTLES OF HISTORY!"], "20": ["DAVID COPPERFIELD!", "VERSUS!", "HARRY HOUDINI!", "BEGIN!", "You've never seen a body quite the same as that of Houdini!", "Slippery like linguine, sneaking out of teeny-weeny", "Little spaces small enough to fit your talent, David", "You're not a challenge, David", "Your biggest endowment's your bank account balances, baby!", "So abracadabra, you billowy bitch", "Man, you look like a pirate on a Las Vegas strip", "I'm swallowing needles and spitting out evil ", "You couldn't escape from a flash paper bag", "I'm badder with patter and matter of fact", "You can't match all my skill if you sawed me in half", "When I was a child, you were a god to me", "I had to do what you do", "But now you're like a Chinese wall to me", "Bitch, I'll walk right through you", "This ain't the magic that you're used to", "I float a rose, hands free, like it's Bluetooth", "My grand illusions make your parlor tricks irrelevant", "The foot of Lady Liberty is stomping on your elephant", "You failed at making movies and you failed at making kids", "You should stick to what you're good at and lock them lips", "(Ohh!) Here's a tidbit that might drive you nuts", "I bought half of your shit, and I keep it locked up", "Got the slim fingers that were built for sleights", "You're a chunky stuntman; dressed in tights", "You talk shit about your hero; that ain't right", "But you can look up to me now; I know you like heights", "Ah! Your hack of a Bob Saget-y act is embarrassing", "You're the saddest thing to happen to Magic since The Gathering", "I'm hanging by my ankles, on a crane I dangle", "I got lox on my bagel that you couldn't handle", "Smash your mirrors while your flying wires tangle", "You can't hide shame with a camera angle", "Did somebody say Angel?", "No", "Oh", "See what they'd be watching if it wasn't for me?", "I remind the world that magic is supposed to make you happy", "While you waste time proving everybody wrong", "I'm backstage getting my supermodel groove on", "You should relax, take a private trip", "To my private island, suck my private dick", "I summon up a little Halloween brunch", "Deep-fried sucker with a side of punch", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC. RAP. BATTLES...", "...OF", "HISTORY!"], "21": ["DEADPOOL!", "VERSUS!", "BOBA FETT!", "BEGIN!", "Oh, is it me? Well, here's my first issue", "I barely even know enough about you to diss you", "But do you guys honestly think that I'd screw this feud up", "And lose to the dude a huge toothy cootchie chewed up?", "That's bananas! I do damage when I brandish my katanas", "Man, I'll slice you up then vanish in my ladybug pajamas", "I'm one of a kind, you're a Xerox of your papa", "Doing temp work for Vader and odd jobs for Jabba", "I'm tight, you're mad baggy; I'm toned, you're so flappy", "Mad cause Sam Jackson killed your clone daddy", "Somebody oughta put a bounty on that cape", "Maaaybe I'll write a letter, and mail it in your face", "Good thing I keep Tums in the Slave 1, cause your style makes me spacesick", "And your bars are like your old pal Cable: fucking basic", "I'll smack a merc in the mouth if he doesn't quit running that lip off", "Bitch, who you calling clone, you're a Deathstroke rip-off", "You stole Spiderman's eyes and Snake Eyes' weapons", "You got Wolverine's powers, man, you're comic sloppy seconds", "That Dr. Killebrew dude needs to go back to med school", "'Cause right now, you're no good to me, Deadpool", "Ooooh, what's that? A missile backpack?", "Well, I guess you'll be alright if a fucking bird attacks", "Presenting the most overrated character anyone ever saw", "With five lines in the trilogy, and one of them was \"AAAH!\"", "I only need five lines, 'cause I look fucking great", "You look like someone spilled lasagna on your face", "But you're worth a lot to me if I bring you back dead", "Schizophrenics pay triple, one for each head", "Who you calling schizophrenic? You've got two different voices!", "You're like your holiday special, man: full of bad choices", "You think your chimichanga's hot, but you couldn't be milder", "You should've made the choice to ditch the prick from Van Wilder", "And the coolest things about you got straight-up abandoned", "You let a kiwi hold your gun and he fucked up your canon", "So maybe don't talk about movies cause you've got dick to say", "Wrap that arm dart around Jar Jar and go far, far away", "I'm a legend, you're a trend, you ain't got half the skills I got", "I'll beat your ass with one eye closed: Boba Fetty Wap", "And then I'll call Domino's, she likes what I'm shaking", "She prefers my durasteel to your Canadian bacon", "Now take a lesson from a genuine assassin who's blasting foes", "I come equipped with a full set of sick Mandalorian flows", "Everybody knows you got that power of regeneration", "Now run home and heal from this disintegration", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC", "(wooo!)", "RAP BATTLES OF HISTORY"], "22": ["RAP BATTLES OF HISTORY!", "DOC BROWN!", "VS!", "DOCTOR WHO!", "BEGIN!", "Actually, if you dont mind it's just the Doctor", "Dosen't even really matter who", "Who am I even talking to? Oh yes, you", "The wannabe Einstein minus the 'stache", "Travels through time but with no class", "I'm saving the world while you dilly-dally", "You can't even invent a way out of Hill Valley", "And calm down will you Everything is going to be fine", "You're not going to tear any wonky holes", "In any fabric of space and time", "Actually it's a lot more like a rug really, nevermind", "Let's just say there's an infinite number of me", "Simultaneously kicking your ass with rhyme", "Great Scott you're great! Not", "I spit it hot and generate way more power", "Than one point twenty one gigawatts", "I'm not sure what sort of scientific authority you purport to be", "But I'm a real doctor where'd you get your degree?", "Despite all of your companions", "You couldn't be having less sex", "I don't know what's lamer your fans or your special effects", "You don't get another turn to debate", "Time to face your permanent fate", "Now Dalek my balls!", "EXTERMINATE", "I'm going to die", "At least, this version of me", "Perhaps you'd like another", "Prepare to meet your density", "I'm a mystical medical doc at the pinnacle shifting my physical form", "You're a possibly pedophilic individual", "Who should have never been born", "You got your knickers in a twist", "While you're sucking on my Piccadilly", "But I'm a lot lot different", "Cause you're a pitiful hillbilly", "Hanging with an oedipal kid", "Who's a bawk bawk chicken", "Nobody calls me chicken", "This is between us Scarfy", "Don't try to out-rhyme me", "You'll find I'm as grimy as any slimy time-limey", "I'll use your port-o-potty time machine as my latrine", "You're not a cat with nine lives", "You're a pussy with thirteen", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC!", "RAP BATTLES OF HISTORY!", "DOC BROWN!", "VS!", "DOCTOR WHO!", "BEGIN!", "Doctor Who:", "Actually, if you don't mind, it's just the Doctor"], "23": ["DONALD TRUMP!", "VERSUS!", "EBENEZER SCROOGE!", "BEGIN!", "Wake up, Scrooge! I'm about to take a Dickens of a dump", "On this lonely, homely little miserable grump", "I'm like the star on a Christmas tree, you're like the stump", "I'm not known for my heart but you're still getting Trumped", "You remind me of my ex-wife in a bikini, cause you disgust me", "Keep your TB from Tiny Timmy away from me, don't even touch me", "I don't shake hands, I don't make fans", "I ruin rappers faster than Scottish lands", "Even Jay-Z knows what a pimp I am", "I got my name on the front of the business, man!", "My raps'll haunt you, make you think you're going insane", "You're about to get whooped by three emcees of the ethereal plane", "So when the clock strikes, prepare to enter a world of Christmas pain", "Cause I'm out, I got my own fucking problems, call me 2 Chainz", "How dare you disturb me when I'm napping in my chair", "You're a crappy rap spitting apparition, I ain't scared", "Of this random phantom, haunt all you want, I don't care", "I do not believe in ghosts and I don't believe that hair", "Don't panic, Scrooge, but you're about to crash", "I'm J.P. Morgan, the Ghost of Rich Dudes Past", "Who's properly rocking the Monopoly mustache", "Yo, I own the railroad, I run these tracks", "You got dumped on a bench, now you're pissed at the world", "You should have made like Sebastian, and kissed the girl", "Because your greed is the curse that's gonna tear you apart", "What good is your purse if you're poor in your heart?", "Bah humbug! Your raps don't unnerve me, they're atrocious", "What frightens me the most is your gross ghost proboscis", "Business and success, that's the life I've selected", "So enough with your pictures from the past, I'm not affected", "Well you're about to be right now", "I'm the ghost of what's right now", "Just take a lesson from Yeezy", "You missing the point, Ebenezy", "There's more to life than your work, take it easy", "Even I can make time for Azizy", "Best put some friends on your wish list", "Cause you don't know the spirit of Christmas", "If you did than you would at this moment", "Be sharing your money with some of the homeless", "No! This isn't happening", "Oh, this is maddening agony– wait!", "Actually, harkening back to the dead Donald's lecture", "I still am expecting a final specter!", "Boo! (Ahh!) You're gonna die", "With no one to love you and no one to cry", "Alone by yourself on the bed of your death", "With the stench of regret on your last dying breath", "Cause you've chosen the path of a selfish man", "With Tiny Tim's innocent blood on your hands", "The penance you pay for the way you behave", "Is written as plain as the name on this grave", "Are these the shadows of things that will be", "Or things that may be, only", "If I depart from my course can they change", "Say it is thus with what you show me", "I promise to mend my ways", "A friend to all men is what I will become", "It's Christmas! I haven't missed my chance to be different, God bless us every-", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "EEEEEEEEEEEEEEEEEEEEEEEEEEE", "PIC RAP BATTLES OF HISTORY!"], "24": ["DONALD TRUMP!", "VERSUS!", "HILLARY CLINTON!", "BEGIN!", "I've been in this game too long", "I'm a public servant", "Have been since I met MLK in person", "I'm a woman of the people, that's for certain", "You're a man of the people who don't like turbans", "I was living in the West Wing while you were professional wrestling", "You got skin like Russian dressing", "From too much Russian investing", "You been going bankrupt since the 90s", "If I was in Iran, you couldn't find me", "You don't care about the job, Trump", "You just think the desk is shiny", "I said that I respect your children", "But that wasn't quite right, yo", "Looking like some extras from American Psycho", "First name is Hillary, middle name, Rodham", "Last name is Clinton and lyrics, I got 'em", "You fire celebrities on The Apprentice", "Motherfucker, I fire bin Laden! Crack! coughs", "How do I say this? You're racist", "Ooh, you must get so pissed that your hands are too small to stop and frisk", "So you use your fingers to touch chicks", "She's only 12 years old", "That's enough, shit!", "But she's married, sir", "Just gotta get pushy", "That's your daughter", "Well, grab her by the pussy", "That's assault, brotha!", "Don't tell me the victim's at fault, sucka!", "You don't know shit about steaks, yucka!", "But the ones on the 8th are great, muthafucka!", "Better save the date, I'm gonna rock the vote", "Bad bitch on the scene like Murder, She Wrote", "So go ahead Donald, let me see your flow", "I brought Michelle's speech, borrow some quotes", "Let me just say I respect all females", "But your rhymes are trash", "Put 'em next to your emails", "Our country's in crisis", "Who wants to vote for the mother of ISIS?", "That might not be exactly true", "But I don't do politeness", "You wanna talk about misogyny?", "Your Bill's worse than Cosby", "He left a mess on that dress like you left in Benghazi", "Terrible", "You wanna break the glass ceiling, Hillary, I sense it", "But the only crack you'll find is my ass pressed against it", "The numbers are in and I'm right on your tail", "You don't have the stamina, baby, you're frail", "This will be just like '08 when you fail", "But Trump will appoint you to jail", "How do I say this? You're a two", "And you almost lost the primary to a socialist Jew", "What do the American people gotta yankee doodle do", "To get it through your fat face that they're just not that into you?", "They want a strong male leader, who can stand up to China (China, China, China)", "Not a crooked little wishy-washy bleeding heart vagina", "I'm gonna run these streets like I run my casinos", "More police and less Latinos", "While you bury us in debt buying poor people socks", "I'll create jobs tearing down mosques", "Then I'll use all the best rocks from the site to build a wall", "Dip it in gold and make Mexico pay for it all", "I'll make this country great again", "We'll all be living large", "I'll tell Congress you're fired and put Charles in charge", "'Cause this whole system's rigged and we all know the riggers", "For the last eight years, this country's been run by-", "CAW!", "Are you fucking kidding me with this blah blah blah?", "I've half a mind to feed you both to my oversized-", "CAW!", "I've heard more thoughtful discussion up in TMZ", "You two got brother blocking brother on their Facebook feed", "I'm so sick and tired of this ridiculous shit", "If this is the best my party gets, then my party should quit", "Ha!", "I'm sorry, did I say something that you found funny?", "Wipe that creepy-ass smile off your face and beat this dummy!", "And if she does win the White House, be a man and hold the door", "Don't get your fans stirred up in some sorta Twitter civil war", "Here's an equal opportunity smack down in the sequel", "That's of the people, by the people, for the people", "EAGLE!", "CAW!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "25": ["Come bite my thumb!", "I hope you know the stakes", "I'll put a slug between your shoulder blades", "Then ask what light through yonder poser breaks?", "I hath been iambic on that ass, ye bastard", "My rhymes are classic", "Your crap is drafted by a kindergartener high on acid", "Ye hoebag", "You're an old white Soulja Boy who has no swag", "And no gonads", "Egads, it's so sad", "And to top it off", "You're not a doctor", "I've never seen a softer author", "You crook, you", "I bet you wrote The Twilight books too!", "I would not could not on a boat", "Read any of the boring ass plays you wrote", "Even Horton doesn't want to hear you", "And Cindy Lou Who is afraid to go near you", "You bore people to death", "You leave a classroom", "Looking like the end of MacBeth", "I entertain a child of any age", "You gotta translate what you said on the opposite page", "How you gonna battle with the Cat in The Hat?", "Little kids get scared when I step on the mat", "You think your ruffled neck ass gonna rap to that?", "I got a best selling book about me coming back", "I'm switching up my style like the Beatles with my pieces", "Each is such a wonder with a plethora of features", "You're pathetically predictable", "You think your new book might include a trisyllabic meter and some ghetto Muppet creatures", "The Bard is in the building", "It's a castle I'm a boss", "I bet I'm Parliament", "I'm positive, I'm killing it", "I'm iller than the plague I never caught or cholera", "A baller baller on some cricket bowler business while you're sitting in the bleachers", "You rap fast you do", "Yes you rap fast it's true", "Now lets see how you rap versus Things 1 and 2!", "Oh, No", "We'll smash your Globe", "Yo, you may have wrote the script but now we running the show", "You can take your fancy words and send 'em back home to your mama", "Break our foot off in your ass with our feetie pajamas", "Man we'll cook you up and eat you with some ham and green eggs", "We'll break offa your legs", "Make no mistake", "We in a rage", "All does not end well when we bust out our cage", "You gettin' upstaged Bill", "Yo, you just got played!"], "26": ["DR. SEUSS!", "Versus!", "WILLIAM SHAKESPEARE!", "BEGIN!", "Come bite my thumb!", "I hope you know the stakes", "I'll put a slug between your shoulder blades", "Then ask what light through yonder poser breaks?", "I hath been iambic on that ass ye bastard", "My rhymes are classic", "Your crap is drafted by a kindergartner high on acid", "Ye hoebag", "You're an old white Soulja Boy who has no swag", "And no gonads, egads it's so sad", "And to top it off you're not a doctor", "I've never seen a softer author", "You crook, you", "I bet you wrote the Twilight books too!", "I would not could not on a boat", "Read any of the boring ass plays you wrote", "Even Horton doesn't want to go hear you", "And Cindy Lou Who is afraid to go near you", "You bore people to death", "You leave a classroom looking like the end of MacBeth", "I entertain a child of any age", "You gotta translate what you said on the opposite page", "How you gonna battle with the Cat in The Hat?", "Little kids get scared when I step on the mat", "You think your ruffled neck ass gonna rap to that?", "I gotta best selling book about me coming back!", "I'm switching up my style", "Like the Beatles with my pieces", "Each is such a wonder", "With a plethora of features", "You're pathetically predictable", "You think your new book", "Might include a tri-syllabic meter", "And some ghetto muppet creatures", "The bard is in the building", "It's a castle, I'm a boss", "I bet I'm parliament", "I'm positive I'm killing it", "I'm iller than the plague", "I never caught or cholera", "A baller baller", "On some cricket bowler buisness", "While you're sitting in the bleachers", "You rap fast you do", "Yes you rap fast it's true", "Now let's see how you rap versus Things 1 & 2!", "Oh, no", "We'll smash your globe", "Yo, you may have wrote the script", "But now we running the show", "You can take your fancy words and send'em", "Back home to your mama", "Break our foot off in your ass", "With our feety pajamas", "Man we'll cook you up", "And eat you with some ham and green eggs", "We'll break offa your legs", "Make no mistake", "We in a rage", "All does not end well", "When we bust out our cage", "You gettin' upstaged Bill", "Yo, you just got played!"], "27": ["LAO TZU, SUN TZU, AND CONFUCIUS!", "VERSUS!", "NIETZSCHE, SOCRATES, AND VOLTAIRE!", "BEGIN!", "I'm coming off the Acropolis to start some pandemonium", "Don't bring limp raps to a pimp slap symposium", "The mad gadfly, philosophy was my invention", "Rolling with the flyest nihilist", "And me, their French henchman", "We got the wisdom", "And the wit", "That even I couldn't question", "Dropping Western medicine", "On these East infections", "It's evident", "You've never been", "Our type of mental brethren", "We're better", "Thinkers", "Better speakers", "Better lovers", "Better men", "This type of arrogance is sure to be expected", "From men who speak of wisdom with no clue of what respect is", "You westerners are sloppy, needing discipline in life", "You lack control of yourselves, and of the mic", "While we use precise strikes to disrupt your concentration", "Hand you an ass-whipping our descendants will honor for generations", "We filled a nation", "With patience", "And the presence", "For living", "And you’ll never hold a candle to the wisdom we've written", "Oh, I’ll give you something you can bow and kowtow to", "When I squat down and squeeze out a Tao of Pooh on Lao Tzu", "You need to take control of the life you’re given", "They call me Übermensch, cause I’m so driven", "And I’m a freethinker", "So confronting conformists like you? It’s my job", "Got a sharp wit, like a spit that’ll skewer you like a Confu-shish-kebab (Oh!)", "You flubbed the mission, I'm beating your submissive ass into submission", "Dishing out more disses than letters and pamphlets and plays I've been publishing", "Now that we’ve covered the two Yin and Yang twins, I can move onto Jackie Chan", "Sun Tzu, I’ll be picking apart your Wu with my method, man", "This seminal general isn’t so tough on the mic", "All your men must be like, 'yo, what happened?'", "You’re pitiful lyrically", "Lucky for history, you didn’t author the Art of Rapping", "Bitch, I wrote the Art of War so you better get your guns out", "These white boys getting burned ‘cause guess what?", "Now the Sun’s out", "Asians spitting sick, but no, this isn’t SARS", "Laozi, kick the beat, now Confucius, drop some bars", "Let me be Candide with you, Voltaire", "French drip with the egg noodle hair", "Your ego’s just so distracting", "Free speech doesn’t mean just keep yapping", "And you killed God, so I gotta ask:", "Did he die of shame when he made your moustache?", "You try to plan a new German psyche", "But you just grew hate, me no Third Reichy", "And it all starts with you, you’re the father, Socrates", "Honestly, I think you owe both of your students here an apology", "I wouldn’t exactly call myself a student of this plebe", "Don’t make Nietzsche come over and put a knee up in your chi", "Cause I’m N-I-E-T-Z-S-C-H-E", "And I’ll end any motherfucker like my name in a spelling bee", "Plebe, bitch? I’m toxic like a hemlock sip", "Hang a sandal on the door cause you can suck Soc’s dick", "Sacrebleu, Socrates! You’re making things a little tense", "Come, let’s blind these Chinese hinies with some shiny bright enlightenment", "I'll not be taught camaraderie from a frog who rigged the lottery", "You make a mockery of ethics, so keep your fat nose in your coffee", "Let me be frank, don’t start beef with The Frank", "Who hangs with B. Franks, giving ladies beef franks", "I have turned them on themselves, their chaos is our opportunity", "You must remember, a bowl is most useful when it is empty", "Ugh, Laozi, I don’t mean no disrespect", "But you need to fill your bowl with some shit that makes some sense", "Oh, you don’t want to stand in the path of Lao Tzu today", "I’ll make you move, bitch, get out the way", "Yo, where in the tradition of rap battles is it written", "That two dudes on the same team should squabble like some clucking chickens?", "Man, Confucius, you always trying to put something in its place", "Why don’t you tell your eyebrows they need to fit better on your face?", "Okay, I see, you wanna make it like that?", "I’ll smack that warmongering head out of your to-go box hat", "So here’s the real golden rule, I’m way above you weak rookies", "Confucius say you can all hold these fortune cookies", "WHAT IS WINNING?", "WHO IS NEXT?", "YOU DECIDE!", "EPIC!", "QUIET!!!", "RAP BATTLES OF HISTORY!"], "28": ["ELON MUSK!", "VERSUS!", "MARK ZUCKERBERG!", "BEGIN!", "Call me Musk (uh!), I'm here to help (yeah!)", "Flush a Zuckerturd for humanity’s health", "I'm making brilliant innovations in a race against the dark ages", "You provide a place to discover your aunt's", "Kinda racist", "Got called to Senate", "Data hack", "You acted so robotic, Star Trek’s like:", "\"We need Lieutenant Data back!\"", "I'm Tony Stark with a James Bond sprinkle tossed in", "And I've been flossing since you double-crossed the Winklevoss twins", "Hmm, Data was a Lieutenant Commander, to start", "But, I wouldn't expect you to understand an org chart", "See, here's mine: I'm at the top (top), boss (boss)", "And I'm spitting fire like I'm hot (hot) sauce (sauce!)", "You can’t sneak up on Zuck, I don’t even fucking blink", "I'm the CEO of KNOWING WHAT YOU THINK, INC", "I’ve been looking up your family, it gets dark, my god!", "Couldn't clean your daddy's laundry with apar-Tide-pods", "Watch me: Oculus, Instagram, WhatsApp (post!)", "I'm cleaning up like a Wet-nap! (boast!)", "I drive around in a hatchback (beep beep!)", "I’ll end your story like Snapchat (ghost!)", "Elon you're nothing but an attention-seeking outcast", "And your star is faded like you on a podcast", "Dope smoking with Joe Rogan don't slow motion my pace, man", "When I'm conquering MySpace, it's actual space, man!", "I got a loan from the White House (boom)", "Sent that shit straight to the moon", "Now I'm taking mankind to Mars, but for your kind man?", "I ain't got room", "Your platform only launches depression", "Who put the elf with no friends in charge of human connection? (hey)", "You claim to be some kind of saint, but you ain't", "Why don't you Lean In and FaceMash my musky Dutch taint (grrr)", "I'm destined to rep Earth, you sold us out for some net worth", "Your site got so many Russian bots they should call it the Social Nyet-work", "Ooh, bots! I know A.I. gets you tweeting", "I read your feed while eating toast from robot Morgan Freeman", "You need to start sleeping, we can all see you're tired", "You're about to be CE-Oh shit, he got fired! (ooh!)", "You've got all these companies but they're incomplete", "I've got one and I fold money: income, pleat", "Set your self-driving truck to haul your ass home", "Cause this battle's like Paypal: you got owned!", "WHO WON?", "WHO'S NEXT?", "Y-Y-Y-YOU DECIDE!", "EPIC R-R-R-R", "RAP BATTLES OF HISTORY!"], "29": ["Call me Musk (uh!), I'm here to help (yeah!)", "Flush a Zucker-turd for humanity's health", "I'm making brilliant innovations in a race against the Dark Ages!", "You provide a place to discover your aunt's...kinda racist!", "Got called to Senate, data hack!", "Acted so robotic Star Trek's like, \"We need Lieutenant Data back!\"", "I'm Tony Stark with a James Bond sprinkle tossed in", "And I've been flossing since you double-crossed the Winklevoss twins!", "Data was a lieutenant commander, to start", "But I wouldn't expect you to understand an org chart", "See, here's mine: I'm at the top (top), boss (boss)", "And I'm spitting fire like I'm hot (hot) sauce (sauce)!", "You can't sneak up on Zuck; I don't even fucking blink!", "I'm the CEO of KNOWING WHAT YOU THINK, INC!", "I've been looking up your family; it gets dark, my god!", "Couldn't clean your daddy's laundry with Apar-tide-pods!", "Watch me, Oculus, Instagram, WhatsApp. Post!", "I'm cleaning up like a Wet-nap. Boast!", "I drive around in a hatchback. Beep beep!", "I'll end your story like Snapchat. (Ghost!)", "Elon, you're nothing but an attention-seeking outcast", "And your star is faded like you on a podcast!", "Dope smoking with Joe Rogan don't slow-motion my pace, man!", "When I'm conquering MySpace, it's actual space, man!", "I got a loan from the White House, boom! Sent that shit straight to the Moon!", "Now I'm taking mankind to Mars, but for your kind, man, I ain't got room!", "Your platform only launches depression!", "Who put the elf with no friends in charge of human connection? (Hey!)", "You claim to be some kind of saint, but you ain't!", "Why don't you Lean In and FaceMatch my musky Dutch taint!", "I'm destined to rep Earth! You sold us out for some net worth!", "Your site's got so many Russian bots, they should call it the Social Nyet-work!", "Ooh, bots, I know A.I. gets you tweeting", "I read your feed while eating toast from robot Morgan Freeman", "You need to start sleeping; we can all see you're tired", "You're about to be CE-Oh shit, he got fired!", "(Ooh!) You got all these companies, but they're incomplete!", "I've got one, and I fold money: income, pleat!", "Set your self-driving truck to haul your ass home", "'Cause this battle's like PayPal: you got owned!"], "30": ["FRANK SINATRA!", "VS!", "FREDDIE MERCURY!", "BEGIN!", "Ho! What's wrong with your face? Baby, yikes!", "With those teeth when you're through there'll be no dust left to bite", "Christ, newsflash, kid: this is show business", "Show some class when you dress, shave that bush off your lips! Boom!", "Your band's named Queen, huh? Ain't that sweet", "You dance like you rode a bicycle race with no seat", "That's what's wrong with you people, you'll do anything to get famous", "You changed your name to Mercury, you should've been Freddie Uranus", "You think I haven't heard those things before?", "You're just a bully who's too scared to go to war", "You had a hit song called \"My Way\", but someone else wrote it", "You're the least talented rat in your whole pack of rodents", "You've got four notes in your whole range, you can't act and you can't dance", "I'm more powerful than you when I'm wearing women's pants", "Why do you stand there in a suit? it's like you're trying to bore me", "When I rock the UK, South America gets horny", "Because my songs have balls! They're the anthems of victory!", "Your music is like the sound track to a vasectomy", "You're in the pocket of the mafia, and everybody knows", "Guinea Dago", "Guinea Dago?", "Guinea Dago, Figaro", "Easy, Jaws of Life, I can't stand a racist", "I love the coloreds and the queers, just ask Sammy Davis", "Look, we all want to swing, baby, but you took it too far", "You played butthole roulette and you lost the draw!", "I took one for both teams from a disease no one knew existed", "I didn't leave a mark on history, I French kissed it!", "I'm a champion of the world (World,) extinguished in his prime! (Prime)", "So kiss my ass Frankie (Ass,) but you'll have to wait in line", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEPIC (EEEEEEPIC)", "EEEEEEPIC (EEEEEEPIC)"], "31": ["WOLVERINE!", "VERSUS!...", "FREDDY KRUEGER!", "BEGIN!", "1, 2, Freddy's coming for you", "3, 4, better lock your-lock your-lock your-lock your", "Welcome to primetime, bitch", "Better stay awake like a meth head", "Spread red on your bed spread ’til you're lying there on your deathbed", "You got a healing factor?", "I got a kill-bitches-on-the-ceiling factor!", "Under that mask, you're a singer/actor", "Under my skin I’m a slasher/slasher", "Bitch! I come from Wes Craven's twisted mind!", "You come from comic books that kids get when they're well behaved at Christmas time!", "Flock of Seagulls called", "They want their hairstyle returned", "And that wasn't even my main diss", "It was just a side-burn!", "Nice glove, bub", "But I'm real from bones to teeth", "That claw's like a strap-on", "There's a pussy underneath.", "Don't sleep? That’s all you got for me?", "Could defeat your ass with a cup of tea", "I been to hell and back and whooped Satan’s ass", "You got beat by a Nancy on Elm Street!", "You wanna talk about burns, Mac?", "The PTA turned your face into Deadpool's ballsack", "Wrapped in a Where’s Waldo sweater", "Jason can't talk and he rocks the mic better!", "So step into my catnap!", "See if you can hack that!", "Better hang on to your wack hat", "'Cause your worst nightmare ain't Hugh Jack shit", "Compared to the least of my Weapon-X flashbacks!", "I’m the adamantium champion X-Man", "You'll only ever be half of Edward Scissorhands!", "So don't get me more pissed, chump", "I'll take your whole franchise out with a fist bump!", "Look at the size of your body; how could I possibly think I'm in trouble?", "I can't tell the difference between your action figure", "And your stunt double!", "What's the matter? You look tired, eh?", "I'll be in your bed tonight, unlike Jean Grey", "As for me? I'm a chick magnet", "So heavy metal bitches are real attracted", "What the fuck is a wolverine? Some kind of an angry beaver?", "I was more intimidated by a tiny canadian the first time I saw Justin Bieber!", "That verse stung, bub", "But I've already recovered", "I'll call you tomorrow morning", "If I need my toast buttered", "I ain't got time for this!", "I'm saving the world, what qualities do you bring?", "You're a pedophile from the Midwest", "At least R. Kelly could sing!", "So you've got the wrong room if you're looking for fear", "Only thing that scares me is a fridge with no beer!", "That face tells me you've met your match", "So come back if you've got another itch to scratch", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EeeeEEEEPIC....RAP. BATTLES...........OF HISTORY!"], "32": ["THOMAS JEFFERSON!", "VERSUS!", "FREDERICK DOUGLASS!", "BEGIN!", "When in the course of human events", "It becomes necessary for a battle to commence", "Then kplow! I hit 'em with the illness of my quill", "I'm endowed with certain unalienable skills", "Let me run down my resume, will ya?", "Set up a little place called the United States", "Sound familiar?", "I told King George he could eat a fat dick", "When it comes to declaration I'm the first draft pick", "I'll topple any tyrant, so kings and pirates beware", "I'm so down with revolutions, I invented the swivel chair", "I've many volumes on my shelves, it's true", "But I've yet to read the three books you wrote about YOU", "Looking like a skunk in a three piece suit", "Didn't come back from Paris to battle Pepe Le Pew", "First Secretary of State, VP number two", "Not to mention third president, the fuck'd you do?", "You finished? ...Okay", "Straight outta bondage! A brainy mother fucker here to diss you", "Big hair, big nuts, big issues", "Starting with your nickel: there's a real declaration", "Heads for racist, tails for a slave plantation", "You're a soft white Monticello Marshmallow", "Watching my people sweat while you sat playing cello, Hello!", "But now you're facing me, Freddy D", "I'd never work for your ass, but I'll kick it for free", "(Ugh!) Your stone face on Rushmore ain't nothing", "Check my photos, now that's real muggin'", "The face of a free man, taught himself to read, man", "No compromise, you couldn't whip a 5th of me, man!", "You got a self evident truth of your own", "You let freedom ring, but never picked up the phone!", "Oh Frederick, I've never heard a verse I dug less", "Alright I admit it, I confess", "I participated in a broken system that I hated", "But I needed to keep my financial status situated", "And the words I used were \"hideous blot\"", "To describe the slave trade and the pain it hath brought", "And I fought to stop the trade of new slaves in Virginia", "When I ran the whole state and still made it home for dinner", "So forgive me, I was busy", "Man, I had a lot to do", "But we did it, you're free now", "So...we cool?", "This ain't Louisiana man", "I ain't buying it", "You talk about freedom, but you ain't applying shit!", "So no, we ain't cool", "You founding absentee father", "You had six babies with your slave mama", "And never even bothered", "To free her when you died", "On the 4th of July", "It's a very important holiday", "But what the fuck does it mean to this guy?", "Cause I celebrate December 6th, 1865", "The day the 13th damn amendment was ratified", "And I ceased to be an alien to your unalienable rights", "And \"We, the People\" stopped meaning", "\"We the people, who are white!\"", "Man, you did some good things", "I ain't denying your fame", "I'm just saying, they need to put an asterisk", "Next to your name", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP(x13)", "BATTLES(x3)", "OF HISTORY!"], "33": ["GANDALF!", "VS!", "DUMBLEDORE!", "BEGIN!", "You shall not pass", "I rap fast like Shadowfax", "Tom Riddle me this you bitch", "How’s your little wand", "Going to beat my staff?", "I leave mics in flames torched by Gandalf", "Touch mine, Dumbledore and scorch your other hand off", "You fool, you got Snaped", "You’re not a real fighter", "Death makes you die", "It just make my brights brighter", "You ass is like Gringotts", "Everyone makes a deposit", "We all know you’ve more than a boggart in your closet", "The prophecy forgot to mention this day", "When I knocked your ass back to Gandalf the Grey", "Check your status", "They call me headmaster", "You’re nothing", "Nice staff", "You compensating for something?", "I prefer the company of wizards and I’m proud of it", "You try to win your battles with two fat hobbits", "You think your hairy toed friends are gonna harm me?", "Wait until they get a taste of Dumbledore’s Army", "Do not take me for some conjuror of cheap tricks", "I don’t give a Fawkes about your Order of Phoenix", "I’ll tie a new knot in your beard with your wrinkly balls", "For I am the one rapper to rule them all", "Your spells are a joke", "Not funny ones either", "Mines of Moria?", "Ha!", "More like Mind of Mencia", "I’ll expecto my patronum on your face you little snitch", "And when I’m finished", "I'mma fly like it's quidditch", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEE", "EEE", "EEE"], "34": ["Gandalf", "VS", "Dumbledore", "Begin!", "You", "Shall", "Not", "Pass", "I rap fast like Shadowfax", "Tom Riddle me this", "You bitch", "How's your little wand", "Going to beat my staff?", "I leave mics in flames", "Torched by Gandalf", "Touch mine, Dumbledore and", "Scorch your other hand off", "You fool", "You got Snaped", "You're not a real fighter", "Death makes you die", "It just makes my brights brighter", "Your ass is like Gringotts", "Everyone makes a deposit", "We all know you've more than a", "Boggart in your closet", "The prophecy", "Forgot to mention this day", "When i knocked your ass back to", "Gandalf the Grey", "Check your status", "They call me headmaster", "You're nothing", "Nice staff", "You compensating for something?", "I prefer the company of", "Wizards and I'm proud of it", "You try to win your battles", "With two fat hobbits", "You think your hairy toed", "Friends are gonna harm me?", "Wait'll they get a taste of", "Dumbledore's army", "Do not take me for some", "Conjuror of cheap tricks", "I don't give a Fawkes about your", "Order of Phoenix", "I'll tie a new knot in your beard", "With your wrinkly balls", "For I am the one rapper", "To rule them all", "Your spells are a joke", "Not funny ones either", "Mines of Moria?", "Ha", "More like mind of Mencia", "I'll expecto my patronum", "On your face", "You little snitch", "And when I'm finished", "I'mma fly", "Like it's quidditch", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "35": ["MARTIN LUTHER KING!", "VS!", "GANDHI!", "BEGIN!", "You want to battle wits? see who's a better pacifist", "I fought the caste system, but you still cannot touch this", "Slumdog skillionaire, first name Messiah", "Raps so hot I spit yoga fire", "Everything you preach, I said it first", "You should just jot down these words, plagiarize my whole verse", "Leave your thoughts on the door like the real Martin Luther", "I'm not thinking you shall overcome this Junior", "I'm the King of civil rights from the city to suburbia", "No shoes, no shirt, but I'm still gonna serve ya", "Make you swallow your words so you can break the fast", "Then thank God almighty, you can eat at last", "I admire the way you broke the British power", "But I have a dream that one day you'll take a shower", "Like the H in your name, you ought to remain silent", "Flatten your style like bread, Naan-violence", "You would know about bread, Dr.Birmingham sandwich", "Boycott those grits, sit in with some spinach", "With protests and women, the same advice goes", "Always stay away from the ho's", "I've got so much street cred they write my name on the signs", "I'd ring you for tech support, but I got a no bell prize", "Nigga, we got more beef than one of your sacred cows", "But I'm about to forgive you so hard right now", "I am passively resisting the fact that you suck", "I am celibate because I don't give a fuck", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "36": ["GHENGIS KHAN! VS! *sigh* The Easter Bunny", "BEGIN!", "How you gonna battle? I invented hip hoppin'!", "My little tail swinging and my big ears floppin'", "The Easter Bunny baby, I deserve to be arrogant", "You ugly, rapist, pelt wearing barbarian", "Ooh, what you gonna do?", "You’ve got a bucket on your head and a fu manchu!", "The Great Wall couldn’t keep you out of China", "Watch me rub my foot for luck and stick it right up your vagina", "Ha, ha, ha, come on!", "Your bunny ass about to feel the wrath of Kahn", "Silly rabbit, you’ll need more than luck", "You’ve got two giant ears, but can’t hear that you suck", "I drive a Mongol horde. Your army is weak!", "What? You going to attack me with a posse of peeps?", "I’ll bite off your tail and punch your teeth down your throat", "Then butcher your family, and make a new coat", "Take it easy baby, no need for this meanness", "We should keep it peaceful, homeboy, Jesus!", "I give people candy, you just like to pillage", "Why don’t you get out of my face and go back to your village", "From Poland to Korea, I ravaged the land", "Now my DNA’s in dudes From New York to Japan,  Hah!", "Easter, my ass, you’re not in the Bible", "You’re a fluffy bitch mascot for Hallmark in denial", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "37": ["GEORGE CARLIN!", "VS!", "RICHARD PRYOR!", "BEGIN!", "Here we go, it's George Carlin. I'm a mad dog snarling", "I was born in the Bronx and brought up in Harlem", "I'm dope at spitting bars and getting crowds hardy harr-ing!", "While you're the least threatening black dude since Carlton!", "Now, there's seven words you can't say on a TV set", "Well, this is the pissin' fuckin' cuntin' Internet", "And my cocksucking motherfucking bits are the tits!", "Non-stopping brain droppings like my wit’s got the shits!", "So call this Pryor-hea: I doo-doo on you constantly!", "No pauses in my punchlines, no commas in my comedy!", "You'll be down for the count when this counter-culture counter man", "Serves you with a stand-uppercut you can't counter, damn!", "I'm wilder than Gene when I'm killing the beat!", "You're steady taking second place, that's a Silver Streak!", "Any rap battles with you, I be winning 'em!", "Your style's like two drinks: it's the minimum!", "(Ooh!) It's your boy from Peoria, Illinois!", "One hand on my mic, one hand on my groin", "'Cause ain't no set tighter in this whole damn game", "Even the shit that I spit off the top: flames! (Stand up!)", "My delivery is rupturing the tummies!", "You tell a joke and people go, \"Hmm, that's funny.\"", "My Mama was a prostitute and Grandma ran the brothel!", "Seen some shit but not as awful as your haircut debacle!", "I'm the original brother (Hey!) to give the scene some color! (Hey!)", "The most iconic stand-up comic! Stand down, motherfucker!", "Hey, you forgot the Cos and you know it's a mistake!", "I eat MCs for breakfast like they're made of chocolate cake!", "I'm the greatest...", "What's wrong... what's wrong with my lip?", "Did somebody put something in my pudding?", "I'm the... MC...", "They put something in the pudding. It's in the pudding...", "Oh, shut up, you stupid son of a bitch, you know you blew it!", "I'd have attacked you two first but your hearts beat me to it! (Oh!)", "Cosby, you can't be here! (Ah!) You're making people nervous (Ah!)", "So let me end you real quick like I was Hannibal Buress (Ohh!)", "It turns out you were just like your sweater: monstrous!", "The men that I slept with only wish they were unconscious", "My sex jokes offend, you’re on the sex offender registry!", "Oh, who are you wearing now? Is that State Penitentiary?", "Enough with the roofies, let me move on to Rufus", "My jokes always had bite, you started out toothless", "And you just kept talking, you wouldn't shut up", "Honestly, I'm glad you died. 14 specials was enough!", "And Richard, can we talk? Can I call you Dick?", "Like your fifth wife did when you remarried your sixth?", "At this point, I've got more plastic than flesh", "But my Tupperware body couldn't keep your raps fresh!", "(I think my pudding–)", "So don't throw down with Rivers! The flow is too relentless!", "I haven't thrashed celebrities this bad since The Apprentice!", "I'm closing this battle! No one else compares!", "The only place I'm in the middle is on Hollywood Squares!", "Good morning, movie bombs! Nice shoulder pads, chief!", "I'm a genie in a bottle for some comic relief!", "O Carlin, my Carlin, what can I say about you?", "Except I don't think you've had a good shit since 1962!", "Mork aged backwards and Joan, you must too!", "80 years old but that nose looks brand new! Nanu!", "Yo Pryor, I Doubtfire makes a good shampoo", "Left you running down the street like \"Oh, no!\"", "Comedy ain't easy, I've played plenty of dumps", "And believe me, we've all hit plenty of bumps (Yeah!)", "But now I've got the Flubber flows that'll get the club jumping!", "You got second-hand raps. \"Found 'em Goodwill Hunting!\"", "Got more hair on my arms than a Monchhichi!", "And I'll finish this battle like it's Jumanji!", "I love the prince, but you'll never have a friend like me!", "Thanks folks, that's my time! Gotta set myself free!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC *Laughter* RAP BATTLES OF HISTORY!"], "38": ["GEORGE WASHINGTON!", "VS!", "WILLIAM WALLACE!", "BEGIN!", "There's a difference between you and me, Willy", "I fought 'till I was actually Free, Willy", "I got my face on a quarter", "You got drawn and quartered", "Tortured on the orders of a king, really?", "How'd you get beat by a dude named Longshanks?", "You hot dogged and he cut off your bean franks", "I'm money like a national bank", "Ain't nobody more street than Big G", "Stone face with a grill of sheep teeth", "A Mel Gibson movie is your legacy", "I got a state and a day and a D.C", "(Stroke!) Roll up in a boat", "(Stroke!) You're sleeping, cut your throat", "(Stroke!) I'll watch the blood flow, now who's got that Redcoat?", "Look at you in your little blousy outfit", "Looking like a stiffer white dick than your monument", "I'll knock you the fuck out, mate", "You died owning slaves, I died setting men free (Scot free!)", "That's the highland way, this powdered prick couldn't beat me in a foot race", "I was emasculated, eviscerated", "I had my head chopped off and they put it on a pike", "But I still find time to bust a Gaelic rhyme", "I'll rip your Yankee Doodle arse on the mic", "I'll knock your face off your moolah", "Alba gu bràth! (Gu bràth!) Hoo-ra! (Hoo-ra!)", "Founding Father, but no children", "Crossed the Delaware, but your soldiers couldn't swim", "That's Washington, such a shite tactician", "The fucking British Army didn't even want him", "I'm Wallace! And I'm flawless!", "Stay hidden in your office or suffer great losses", "I pop my kilt, strap my sword in my hilt", "Step on the battlefield and I'm ready to kill", "Send all your politicians straight down to hell", "The only Washington I trust Denzel", "Is that the best you got for me?", "I'll chop down an emcee like a cherry tree", "See, power! That's what the meaning of my flag is", "Your nation's famous for golf and haggis", "I'm fabulous from my head to my shoebuckle", "Step to me, and catch a knee to the mooseknuckle", "Cause I know you don't wear no draws", "I'm dressed like a pimp, best moves in at the ball", "McGlavin, McGliven , McSchool you all", "Cock block more Scots than Hadrian's Wall", "I don't give a shite about your fancy clothes", "You whipped all those out of slave black folks", "Grew weed and you made hemp rope", "But if you think you'll beat me, you must be having a smoke", "No joke! Don't tee off with me, laddie", "If you held my balls, you couldn't be my caddie", "My style's ice cold, yours is old and shabby", "You're the Father of Your Country, but I'm your daddy", "WHO WON?", "WHO''S NEXT?", "YOU DECIDE!", "EPIC!! (EPIC, EPIC EPIC EPIC)", "RAP!! (RAP RAP RAP RAP RAP)", "BATTLES!! (HOOO!)", "OF HAA!! (HOOO!)", "STORY!!!! (AAAHHHHHAAAHHH!!)"], "39": ["THE GHOSTBUSTERS!", "VS!", "THE MYTHBUSTERS!", "BEGIN!", "Are you tired of two geeks in mustaches", "Who can manage to be boring with explosions and crashes?", "If you, or the Lorax, wanna bust like we do", "Give us a call, we're ready to defeat you", "Ghostbusters, flow crushers, get the job done", "Spitting out the lyrics like, 'we got one!'", "Get the people moving like the Statue of Liberty", "Try to beat us in a battle? (Man, you gotta be kidding me)", "The delivery of Stantz stands straight like my main man's slinky", "I collect spores (tell 'em 'bout the Twinkie)", "Like your show, it's all fluff and filler", "I'll kick your hiney man, I'm a savage killer", "Wow, your raps are just too wack to handle", "Let's do it like we do on the Discovery Channel", "Your science is preposterous, the opposite of competent process", "And in this episode, we'll give you a synopsis", "Starting with the vacuum cleaners strapped up on your back", "It's a fact, positrons don't react like that", "You built a laser grid with no safety switch", "And Walter Peck was right, that's some shady shit", "Good thing you work in a firehouse, cause you just got burned", "You are poor scientists, and that's confirmed", "That's enough from the Walrus and Dickless the clown", "Let's show these Mythbitches how we do it downtown", "Grab your stick (holdin'), heat em up (smokin')", "High speed shows your ass get beat in slow motion", "We roast show hosts when our flows cross streams", "Pumping out blockbusters, while you work behind the scenes", "It's a rap test dummy, and you're both getting crashed", "We came, we saw, we kicked your ass", "Ghosts aren't real, but it should be said", "It's time to bring the B-Team back from the dead", "(Hey!) Things are getting scary, when Tory, Grant and Kari", "Come harder than Ray when that ghost popped his cherry", "We reject your flows, and substitute our own", "Uhhhhhhhmmm...", "Why'd you stop? I couldn't think of a rhyme", "Well just say the first thing that pops into your mind", "Aww... aww...", "Yo, raise up, it's Stay Puft, I stay fluff", "Blaze chumps and flip Kari butter-side up (hey!)", "I'mma smother Ghostbusters in fluffernutter, I don't play", "Show these dweebs how to rock a beret (hey)", "I live so large you can't harsh my mellow", "Just one step took me out the ghetto", "You best be afraid of my marshmallow flows", "Cause Big Puft just turned all you bitches to toast", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC! RAP, RAP! RRRRRRRAP BATTLES OF HISTORY!"], "40": ["GOKU!", "VERSUS!", "SUPERMAN!", "BEGIN!", "Who can stop this constipated jock", "With the awful animation and the complicated plot?", "Who's got the rap bombs to drop on Japan?", "This looks like a job for the OG (Superman!)", "I'm killing it, you're Krillin it, I'm villainous to vegetables", "Who dance around in hammer pants that hide their tiny genitals", "My level is incredible, I'm out of your league", "You want justice? I'll bust this nut up in your Chi Chi", "Greasy slick emcee from DC", "One breath, I'll freeze your whole measly species", "You're primitive and limited, you live in a village of idiots", "Step in Metropolis, I'll snap a carrot, period", "How many times are they gonna rewrite your story?", "Your powers have been boring since the nineteen fucking forties (GOKU!)", "Defeat me with heat beams? You're crazy", "Cause I'm a Super Saiyan, you're a flying Miss Daisy", "You're pretty pasty to be powered by the sun", "You can't flow to Son Goku, I Kaoiken get it done", "When I see your movies all I do is watch the clock", "Cause there's nothing fun about a superhero scared of green rocks", "Look at those panties (ho!)", "You got that camel toe", "I'll report to Lois Lane, then Superman that ho", "Haha, your rapping is weaker than your fight scenes", "Just one punch and over 9000 screams!", "I'll make your nose bleed like Roshi sniffing panties", "From Z to GT, you can Dragonball deez", "Don't lecture me about fights, you caped coward", "You got your ass beat by a bat with no powers", "There's only one way that this battle's gonna end", "One more Superman who's never gonna walk again", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EP! IC! RAP! BATTLES OF HISTORY!"], "41": ["GORDON RAMSAY!", "VERSUS!", "JULIA CHILD!", "BEGIN!", "And that's how you make a perfect risotto", "Right, Mrs. Child, welcome to the grown-ups’ table", "I've got exactly two minutes and you should be grateful", "Cause I'm in the fucking weeds with all these shows to pitch", "I keep my ovens preheated and my pilots green-lit", "I'm a seasoned skillet, you're a PAM-sprayed pan", "I've got Michelin stars, you're like the Michelin Man", "I'm rolling in dough, like Beef Wellington from hollering", "And I'm shitting on you like I'm wack flows intolerant", "Oh, isn't that a wonderful thing?", "A grumpy little chef who thinks he can bring", "Enough stuff to justify getting rough", "With the butter-loving queen of the bourguignon boeuf", "I rock hard as concrete on top of these bomb beats", "Been chopping the pommes frites since you sucked on your mom's teats", "I served America dutifully, and I sliced lard beautifully", "I reigned supreme from shark repellent to charcuterie", "Go on and cross your arms in that b-boy stance", "And when it comes to haute cuisine, there's one F-word: France", "Here's a nice amuse-bouche, take a poor abused youth", "Set a thirty-year timer, voila! Huge douche!", "You're a namby-pamby candy-assed pansy, Gordon Ramsay", "You couldn't rap your way out of a pastry bag, understand me?", "I laugh and create, you berate and destroy", "But fear, my dear boy, is less scrumptious than joy", "I'm glad that you got that off your giant, flabby chest", "I'd call you a Donkey but you look more like Shrek", "When the Iron Man chef busts a rhyme", "I'll open up on you like a fine red wine", "I'm a culinary innovator, you're no creator", "Regurgitating French plates like a glorified translator", "I'm fresh, you're past your expiration date", "Alright, fuck it, blue team, drop the bouillabaisse (yes, chef!)", "I’ve seen your little show and it sure ain't pretty", "One part Big Bird, two parts Miss Piggy", "You can't test me with your fatty recipes", "Call your book \"Mastering the Art of Heart Disease\"", "I mean, it's rubbish, (yes, chef!) look at page 408", "Tell me, who the fuck (yes, chef!) wants to learn to cook calf brains?", "You call these rhymes raw? (no, chef!) They're stale and soft", "Now, here, take this jacket…", "Now give it back and fuck off!", "Oh please, your defeat's guaranteed", "Concede, I've got this in the bag, sous-vide (ha!)", "Michelin indeed, you've done well for yourself", "But as a person, you couldn't get a star on Yelp", "I could freeze a steak with those frosted tips", "What's with that bitter taste in every word from your lips?", "You scream at women, but the fits that you're pitching", "Make you the pissiest bitch in the kitchen", "I'll pat you on the head, melt you, and stick it to ya", "Anything's good with enough butter, boo-yah!", "Oh, I'm so glad you spent this time with me", "Now eat a dick, bon appétit", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!"], "42": ["RASPUTIN! VERSUS! STALIN!", "BEGIN", "Cool mustache, Wario", "Try messing with the Mad Monk you'll be sorry, yo", "How many dictators does it take", "To turn an empire into a union of ruinous states?", "It's a disgrace what you did to your own people", "Your daddy beat you like a dog and now you're evil", "You're from Georgia, sweet Georgia", "And the history books unfold ya!", "As a messed up motherfucker bent in the mind", "Who built a superpower but he paid the price", "With the endless destruction of Russian lives", "If you're the man of steel I spit kryptonite!", "Big dick mystic known to hypnotize", "I could end you with a whisper to your wife", "Look into my eyes you perverted witch", "See the soul of the man who made Mother Russia his bitch", "You think I give a fuck about my wife?", "My own son got locked up in prison, and I didn't save his life", "You got off easy when they pickled that moose cock!", "I'd leave your neck in a noose, in a trench, and shot!", "Your whole family? Shot! All your wizard friends? Shot!", "Anyone who sold you pierogi? Shot!", "Starve you for days til you waste away", "I even crush mother fuckers when I'm laid in state", "Pride of Lenin took Trotsky out of the picture", "Drop the hammer on you harder than I bitch slapped Hitler", "I have no pride for you who ruined everything", "My revolution was doing to stop the bourgeoisie!", "I fought the bondage of classes, the proletariat masses", "Have brought me here to spit a thesis against both of your asses!", "Let me start with you there, Frankenstein!", "Looking like something out of R.L. Stine", "It's hip hop chowder, red over white", "Cause the Tsar's wife can't do shit tonight!", "And Joseph you were supposed to be my right-hand man", "But your loyalty shriveled up like your right hand, man!", "Our whole future was bright, you let your heart grow dark", "And stopped the greatest revolution since the birth of Marx!", "Knock knock knock knock", "Did somebody say birthmarks?", "Yo I'm the host with the most Glasnost", "Assholes made a mess and the war got cold", "Shook hands with both Ronalds; Reagan and McDonald's, no doubt!", "If your name end with 'in', time to get out!", "I had the balls to let Baryshnikov dance, playa!", "Torn down that wall like the Kool-Aid Man (Oh yeah!)", "You two need yoga, you need a shower", "And you all need to learn how to handle real power!", "Did somebody say real power?", "Дa, you want to mess with me?", "I spit hot borsch when I'm crushing these beats", "Blow it up like a tuba while I'm balling in Cuba", "Doing judo moves and schooling every communist сука.", "I'm a president in my prime, my enemies don't distract me", "The last man who attacked me, lived a half-life, so comrade come at me", "You don't know what you're doing", "When you try to bust a rhyme against a mind like Putin", "You'll find that the ex-KGB is the best MC in the ex-CCCP!"], "43": ["GUY FAWKES", "VS", "CHE GUEVARA", "BEGIN!", "Guevara the terror, fresh Kangol wearer", "Ill rhyme slayer from the 60's era", "Revolting heavy metal rebel blood spiller", "Me and my guerrillas are a squad of killers (Hoo!)", "I’m known worldwide for my steely-eyed look", "You're famous cause of Alan Moore's third best book", "All the children say we will be like Che", "Asthmatic, but I’ll take your breath away *gasp*", "You tried to rebel against James the first", "Here's a tip for your next plot, try to rehearse!", "I got my face on a magnet on your roommate's fridge", "Your head is on a spike up on London Bridge!", "You had one job cabrón, to strike a matchstick", "Got caught with a fuse like your bars, not lit", "You should have stayed anonymous, Epic Fail Guy", "Treat this battle like the gallows and take another dive", "As a communist it must really hurt", "That your face has been cheapened, weakened, besmirched", "Being plastered on posters, coasters, and shirts", "Making capitalists rich off of you on merch", "Right, I'm a pious man and I fight for the lord", "I would cut you but I don't want your sweat on my sword", "I was tortured until I could hardly sign my name", "And listening to you felt pretty much the same (oooh!)", "Face it, Ernesto, you're Castro but less so", "He's Cuba Commander, you're more of the Destro", "Revolt all you want, I don’t give two Guy Fawkes", "But look at Venezuela; what you’re fighting for sucks", "Sucks? Guy, you died for the Catholics", "A group with a bad touching little boys habit", "And this porn star pilgrim look what's up with that?", "It’s more like V for very bad hat", "Oh! What's the Fawkes say now?", "(KA! KA KA KA KA-KA!)", "When they cut your junk out", "I'm the hardest Marxist ever graced a banknote", "You're an error prone terrorist penny for the scapegoat", "Don’t try to boast 'bout your banknotes with Guido", "You muddled your economy like mint in a mojito", "This very battle disproves your communist initiative", "These rhyme skills are not evenly distributed (aah!)", "I'm Catholic I've got mass when I'm rapping", "You're an ump-Che, that's Bay of Pigs latin", "After what just happened you should retire", "Is it the 5th of November? Cause I'm on fire!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "44": ["Henry:", "I am Henry VIII! Kind of England, Ireland, and Wales!", "You're a presidential candidate in a pants suit who fails!", "Girls don't belong in politics, too much stress!", "Should stay at home and wash the stains out of another lady's dress!", "I tend to have separation issues with women", "Its like their head's the pope and their necks, the Church of England!", "Madam Secretary? Hold my calls, I'm off for a walk", "'Cause no one's beat you so bad since the Swahili dude named Barack!", "Hillary:", "Hahaha! Lets just get down to it", "You done messed with the wrong Rodham, I'm about to tutor and boot it", "You make more false accusations than our white water", "Its not your wive's fault your balls keep making daughters", "Your country's the size of Ohio, you couldn't even beat Spain", "I could defeat you with a grass roots email campaign!", "I'd eat you alive, but I'd probably never finish", "You're so fat your whole body could feed a whole freakin' village!", "Henry:", "I'm big because I'm God's Appointed Vessel", "The only way you can beat me is maybe if we wrestle", "I mean, come on, is it any wonder why you can't keep your man at home?", "The only thing getting blown is Bill's Saxophone!", "Hillary:", "You couldn't even handle the goods that I'm selling!", "I'm more powerful than Oprah! (And more handsome than Ellen!)", "Don't you interrupt me, you chauvinist prick!", "Put the needs of your country behind the whims of your dick!", "I'll banish you back to your own tower of London, baby", "You can tell them Henry VIII got spanked by the First Lady!"], "45": ["KIM JONG-IL! VS! HULK HOGAN!", "BEGIN!", "The name’s Kim Jong, I got a license to ill", "Make you swallow my rhymes like a steroids pill", "Your body looks like a spray tan banana", "With a walrus mustache and a wack bandana", "I’m coming at you like the Asian Ric Flair", "Bitch, I’ll suplex you by your friggin dick hair!", "Your whole fam’s a bunch of Barbies, dude", "You want beef? Eat this Korean BBQ!", "You got a ring side seat to your own smackdown, brother", "You look like Sonic the Hedgehog’s mother", "You’re a freak, a phony, a rice-a-roni jabroni", "I’m gonna bounce you like a check for my alimony", "Come on dude, all the little Hulksters know", "I’ll hang you from the ropes like South Park puppet show", "I’ll choke hold you hostage like Laura Ling", "Brother I’ll leg drop your ass back to Beijing!", "Beijing is in China, you blond asshole", "I’m a god among men, you’re a suburban commando", "North Korea, bitch, let me give you a tour", "By the way, your wife says my dick is bigger than yours!", "Hulk Hogan goes down! I don’t know if he can finish the battle... He’s reaching for the ropes! It's.. It's Macho Man Randy Savage!", "Ooh yeah, it’s about to get real", "Watch me snap into a Slim Jim Kim Jong-Il", "I don’t like to hit little bitches with glasses", "But when midgets step up, I stomp midget asses", "The Macho Man, there is no equal", "So spend less time rapping and start feeding your people", "PUNK, I’ll elbow drop your whole nation", "On behalf of the entire World Wrestling Federation!", "Ooh Yeah!", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "46": ["JACK THE RIPPER!", "VERSUS!", "HANNIBAL LECTER!", "BEGIN!", "Oi mate, pass the liquor, it's Jack the Ripper", "Jack the Rapper, following you way before the dawn of Twitter", "I'm a human trigger warning, through the night until the morning", "When the light shines upon my crimes, you find it sick, appalling", "An infamous, notorious delinquent", "There's little more gory a thing than", "Living in Victorian England", "This is horrorcore, beware if you're a common whore", "Or at late night you may find me knocking on your door", "Not keen to leave until I'm knee deep in blood and gore", "Your grieving family on their knees, weeping, scrubbing floors", "The police need a lead, they dunno what they're looking for", "My raps are like the way I eat my meat, bloody raw", "Jack, you're a classic megalomaniac", "You haven't mentioned me once in your entire battle rap", "Pity your verse wasn't worth a trip in the jacket", "Quit jacking off on the track and put the lotion in the basket", "And catch what the iller serial killer can deliver", "Rhymes finer than the Chianti I would pair with your liver", "But the thought of your putrid flesh makes me want to shiver", "Cause your British body's covered in more piss than kitty litter", "You stabbed women when they wouldn't give you attention", "Like a Penny Dreadful version of OJ Simpson", "But these days your nickname is all that's even known", "And you didn't even come up with that shit on your own", "I'm real! You'll find me making vacancies in brothels", "While you only exist inside the pages of a novel", "You were kept for ages in a hovel", "Contained within a cage behind a locked door", "While I never got caught", "So who's the superior serial killer, Doctor Lecter?", "I'm still wanted, you're forgotten", "People these days are watching Dexter", "So God protect ya from the hell I've spread upon us", "I'm terrorizing London, fuck the 7/7 bombers!", "No, no, Jack you were doing fine", "Before your ham-fisted attempt at a terrorist line", "How typical of Jack the Ripper to chase a headline", "Pick Ray Liotta's brain and ask him how I get mine", "I'm the bon vivant of violence, a licensed psychiatrist", "Who dines on highest society to the sound of violins", "Don't get me wrong, I'd roast both your balls on my hibachi", "But for a serial killer, you're as tasteless as a bowl of Kashi", "You prey on a prostitute and play with her body", "I don't mind that you're naughty Jack, I hate that you're sloppy", "Barney, take me back to solitary confinement", "Cause this dirty little lamb has just been silenced", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEEEEEEEE- [Scream] -PIC RAP BATTLES OF HISTORY!"], "47": ["JACQUES COUSTEAU!", "VS!", "STEVE IRWIN!", "BEGIN!", "Jacques Cousteau, here to spit flow", "Invented SCUBA, captained the Calypso", "Palme d’Or winning documenter of the ocean", "Ready to battle a desperate, sweaty showman", "You’re chunky and soft, you get on my nerves", "You're the only manatee I don’t want to conserve", "My Life Aquatic was adventure and beauty", "I’m so cool, Bill Murray played me in the movie", "I have Oscars! You’re in Doctor Dolittle 2", "So run back home to your daddy’s zoo", "And just to be clear, ‘cause I’m no veterinarian:", "Were you killed by a fish kids pet at the aquarium?", "Holy smokes, what a place to go!", "You’d need a submarine for a blow that low (Awhh!)", "You'd better run! You’d better take cover!", "'Cause crikey, I’m going from croc to Jacques hunter!", "Have a look at this salty fella:", "His face looks like it’s made of pure leather!", "Look out! He’s got the body of a naked mole rat", "He’s cranky ‘cause he has to wear a Papa Smurf hat", "I’m a wild man, you’re a subdued sub dude", "The only crocs you could handle are some slip-on shoes", "Crikey! You’re such a boring guy", "You could make a whole show about the ocean dry", "But with the sheilas you sure had fun", "Your mistress was as young as your first-born son", "You never shoulda stepped to the wildlife defender", "Now embrace your French nature and quietly surrender", "Talk about sons, better watch what you say now", "You almost turned yours into Outback Mistake House!", "Would you rather talk about your brother? Ooh boy", "Nazi! Nazi! Nazi! Oy yoy yoy!", "Enough of your antics and madness!", "Contain yourself, like my underwater breathing apparatus", "You’re a joke of a bloke in a tacky khaki romper", "Go grope a nope rope, Crocodile Humper", "There’s a type of snail, recently discovered", "And named after you — I’ll eat them with butter!", "Hey Skippy The Bush-League Kangaroo", "Hold the dee, I’m Crocodile Dun with you!", "Where ya goin', fella? Hang on a minute", "Like a Joey in a pouch, this ain’t quite finished", "Take a look how destructive your old films are", "Silent World? More like Silent Worldstar!", "If you wanna count fish, please take the reef tour", "Don’t go throwin’ C-4 on the seafloor", "I’m the gold medal rhymer on the podium", "Cleanin’ you up like a Jacques Custodian (Wooo!)", "I’m Mother Nature’s greatest conservationist", "When I rock the mic, I’m danger! Danger! Dangerous!", "So go back down under with your crew", "I just blew through you like a didgeridoo", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "48": ["JAMES BOND!", "VERSUS!", "AUSTIN POWERS!", "BEGIN!", "I’ve beefed with Le Chiffre and No and Blofeld with the cheek scar", "But they were not as crooked and rotten as your teeth are", "I’ll go balls to the Walther on this whack twat in an ascot", "Blast shots atcha like gas from the back slot of a fat Scot", "Permission from the Crown to put a scoundrel down? I’ve earned it", "I’m licenced to kill, you couldn’t get a learner’s permit", "After twenty-four films, I’m still reaching new heights", "Your third movie died, guess You Only Live Twice", "Spell my name, the ladies wanna B-on-D", "Any sex appeal you might have is beyond me", "I’m bespoke from my head to my toe and after this flow I’m done", "I only need one round, *gunshot* Golden Gun", "You look a lot more blonde in your movie, baby", "That's alright, let's just keep it groovy baby! (Yeah!)", "Basil Exposition told me this would be boring", "But Jesus, man, even my mojo's snoring!", "I've never seen such a miserable spy", "I've also never seen a man with glistening thighs", "I mean you can't shag properly with that waxed tush", "Birds flock to the musk of my chest bush (Yeah!)", "I hypnotize you with a little strip tease", "And then judo chop, I'm swinging on you like the sixties (Yeah!)", "You're defenseless; my rhymes can't be deflected", "You're like all the sex I've ever had, unprotected (Yeah!)", "People want a hero with a little personality", "No one wants to sit through your gritty reality", "Maybe Q can craft some new plot lines", "You've made Thunderball two bloody times!", "I'm one of a kind you're always getting remade", "You can't touch me, double-oh behave", "Ugh! Can't believe I'm wasting my time with this clown", "I should be on an island with a fucking model by now", "Sipping dry martinis and peeling off bikinis", "Not rapping against Swedish penis pumping weenies", "Yeah that's not mine-", "I didn't say I was finished, I'm sick of your silly gimmicks", "I'm the best spy in the business; just ask all the critics", "I've been through hell, so yeah, I'm a bit of a cynic", "But I'm the original model that your frilly ass mimics!", "(I wouldn’t exactly call you original...)", "It’s the most prominent dominant bomb spy, so pay homage", "Handing out ass-whippings, I’m on some real James Bondage", "Your performance doesn’t stir me and I’m certainly not shaken", "If I wanted shitty acting in my action film, I’d go and watch Taken", "I see your modern gadgets and I piss on them all", "I don’t need a Q to break your balls", "I’m the granddad of the brand millions of fans have been sold on", "You’re so far up on my nuts I should call you Bond… Gold Bond", "Yeah, um, could I get back in my rap please?", "*slap* Rap these, you velvety hack!", "Jeez!", "It’s the movie business and you’ve had your six", "The world has had quite enough rug-wearing misogynists", "Yeah, to be honest, you are a bit rapey", "I mean, I like to swing but Dr. No means no, baby", "Oh please, I’m an extraordinary gentlemen, I'm distinguished", "If they made a Mini-Me, they’d have to cast Peter Dinklage", "Well maybe they should cast a Bond who’s actually English", "*slap* Why, pussy, aren’t you the cunning linguist", "As a matter of fact, I’ve got a knack for licking old cunts", "After I beat you, I’ll kick the shit out of the man who does your stunts", "Now you listen here, you little duck-faced runt", "I’m all in, I’m ready to die any day that you want!", "WHO WON? (WHO WON?)", "WHO’S NEXT? (WHO’S NEXT?)", "YOU… YOU DECIDE!"], "49": ["STAN LEE!", "VERSUS!", "JIM HENSON!", "BEGIN!", "Greetings heroes, Stan Lee's here to battle", "It's the mind behind The Hulk against the geek beneath the Fraggles", "I'm just your friendly neighborhood writer man with a secret identity of a super MC", "Whose raps are as dark as my shades, leave you squealing like:", "MEMEMEMEMEMEME", "You're in trouble now Jimmy, you dirty old hippie", "Your beard needs a little bit of snikt, damn skippy", "Heck, that face on your neck ain't sexy", "You're one part Sweetums, the other part Skeksis", "Step up to Lee and get your butt kicked", "Your Muppet Snuffleupagus stuff is bupkis", "I broke Ferrigno and the Comics Code", "So keep your frog and pig show moving right along down the road", "I'm glad you got that out", "(That anger can clutter your mind)", "But you're a creative man Stanley (Yeah)", "So let's just leave it behind", "Cause I can sense your tension, once the verbal fencing starts commencing", "There is no defense against the dents Jim Henson is dispensing", "And I'm clenching all your strings like you're a puppet in suspension", "Call your superhero friends in", "(Yeah, cause you're gonna need Avenging)", "Let me mention I'm impressed by all the vision that it took", "For you to sign your name", "(On all of Jack Kirby's comic books)", "Nice try, frogman, but Jack was a friend of mine (THWIP)", "That was a low blow, he did his own Thing", "And now you've made it clobbering time (SPLONK)", "Oh, you taught children to count and spell", "Then you taught your own kids how to drop your wife harder than you flopped on SNL", "I'm telling you Henson", "You wouldn't like me when I'm angry, I'm a marvel of a party pooper", "I'll snap your turtleneck like a Doozer stick and put you out to pasture like Mr. Hooper", "I'm sorry Jim, sometimes I can't control my rage", "Honestly, there's a lot of things that you can't control at my age", "But the truth is I miss ya, you were gone too soon", "You were like watching a beautiful sunset... at noon", "Ah Stan don't be sad, we all have a time to go (Yeah)", "Most of the Internet thought that you died 12 years ago", "But the Four will always be Fantastic, the Hulk will always be Incredible", "The words you wove within the hearts of heroes are indelible", "There is no beef between us, we're two minds of the same kind", "And there is no man who could ever muck with what we've left behind", "(M-I-C)", "I rock the mic properly", "(K-E-Y)", "Turning profits I've got the key", "I'm the Juggernaut of stacking knots unstoppably", "The Disneyland-lord of your intellectual property", "So get back to work, that's my dime you're wasting", "I didn't buy you for billions so you could play around debating", "Ah, you belong to Disney, which means you stay busy", "Cranking out magic and assembly line whimsy", "Artists begging me to stop, I won't let 'em!", "Labor conditions in my shop? I don't sweat 'em!", "I'm powerful enough to make a mouse gigantic", "With only 3 circles I dominate the planet", "Clearly, there's nobody near me", "I'm owning this battle, in fact, I own this whole series", "So hop on my Steamboat boys, but don't rock it", "I'll put a smile on your face, and green in your pocket", "You'll be safe and insured when you're under my employ", "Now look at it! Gaze upon my empire of joy!"], "50": ["GEORGE R.R. MARTIN!", "VERSUS!", "J.R.R. TOLKIEN!", "BEGIN!", "Brace yourself!", "Gather up your trolls and your soldier Elves!", "And your Ents and your Orcs and your Wargs and your Stings", "Your Dwarves and Glamdrings", "Cause there's a new literary Lord in the Ring!", "My readers fall in love with every character I've written", "Then I kill 'em (Aaaahhhh!) They're like 'No! He didn't!'", "All your bad guys die, and your good guys survive!", "We can tell what's gonna happen by page and age five!", "Tell your all-seeing eye to find some sex in your movies (Yeah)", "Ditch the Goonie, and cast a couple boobies!", "There’s edgier plots in that David the Gnome", "Your Hobbit-hole heroes can’t handle my throne", "Kings, queens, dragons, dwarves", "Horses, fortresses, magic and swords", "You Hob-bit my whole shit, you uninspired hack", "You want a war, George? Welcome to Shire-raq!", "In book sales you’ve got nothing to say", "I’m number one and two, you’re under Fifty Shades of Grey", "I’ve got the prose of a pro, your shit’s subpar", "You’re a pirate, you even stole my \"R.R.\"", "Oh, we all know the world is full of chance and anarchy", "So yes, it’s true-to-life for characters to die randomly", "But news flash, the genre’s called fantasy", "It’s meant to be unrealistic, you myopic manatee", "I conscientiously object to what you’re doing on these beats", "I’ll cut you like my teeth on Beauty and the Beast", "You went too deep, Professor Tweed Pants", "We don’t need the backstory on every fucking tree branch", "I cut my teeth in the trenches of the Somme", "You LARPed your Santa Claus ass through Vietnam", "And it’s hard for me to take criticism on clothes", "From a dude who sends a raven to say \"Hi\" to his toes", "Man, your fat jokes are worse than your pipe smoke", "My show’s the hottest thing on H-B-O!", "I’m rock and roll, you’re a nerdy little nebbish", "And I may be dirty, but you got a hairy foot fetish, dawg", "Even the names of your characters suck", "You got Boffers and Bofurs and Brandybucks", "I got a second breakfast for all them goofy fucks", "Lift up my gut and tea-Baggins my nuts", "C. S. Lewis and I were just discussing", "How you and Jon Snow... both know nothing!", "Because the backstory of my box office is billions", "Got my children making millions off my Silmarillions", "And I’m more rock and roll than you’ve ever been", "Don’t believe me? Ask Led Zeppelin", "You can’t reach this Fellow, shit, I’m Two Towering", "(Ooh) Every time I battle, it’s Return of the King", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!"], "51": ["JUSTIN BIEBER VS LUDVIG VAN BEETHOVEN!", "BEGIN!", "Look what the cat dragged back from the dead", "Man it looks like Chewbacca wiped his ass on your head", "I’m the next Michael Jackson, you smell like Betty White", "Here’s some aspirin, you’re catching Bieber Fever tonight", "Because my voice is incredible and your music is terrible", "Who even listens to Classical anyway?", "Even Elise wants to do me and now that you’re right next to me", "I can understand why they used a dog to play you in the movies", "Sit down, son, and let me give you a music lesson", "Ask Bach, I got more cock than Smith and Wesson", "Never say Never? You’ll never be forgetting", "I’ve crafted masterpieces that will last throughout the ages", "Your music gets you bitches on your Facebook pages", "I’m committing verbal murder in the major third degree", "My name is Beethoven motherfucker Maybe you’ve heard of me?", "Not the Saint Bernard Version, I’m the real O.G", "You wanna trade blows? You can’t even hit puberty!", "I got Kim Kardashian in my bed backstage", "When’s the last time your music got anybody laid?", "I’ve got a concert in five, so there’s not much time left", "What else can I say? Your own music made you deaf!", "I would smack you but in Germany we don’t hit little girls", "And I’m glad I’m deaf, so I can’t hear that piece of shit “My World”", "There’s a crowd of millions waiting to hear my symphonies", "You wanna be a little white Usher? Here, show them their seats!", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "52": ["FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS!", "LARRY BIRD!", "VS!", "BIG BIRD!", "BEGIN", "What's up? It’s your boy from Sesame Street", "Here to rap against a freak with size 17 feet", "You're like Oscar the Grouch's house because you’re trash", "Walkin 'round in green like Shrek with a mustache", "Larry Bird? More like Scary bird you ogre", "You look like Frankenstein's monster but older", "You're trying to battle with a childhood hero", "This one on one is gonna end with Larry Bird, zero", "The Legend spits raw like an oyster", "Bout to school this muppet how to rap so let me give you 3 pointers", "One, don't talk about being a freak", "You got accordion legs and Burt's head for a beak", "Two, don't dress in yellow when you come to Boston", "I'll slap your happy ass and call you Magic Johnson", "Three, you don’t deserve a prize just for trying", "The only thing you taught kids is how to suck at flying", "Wow, I can’t believe what I just heard", "No way you just called me the flightless Bird", "You can't jump you can’t run stick to the threes", "'Cause The Hick from French Lick surely can't hit me", "I'm Snuffleupagus the way I bob and weave", "I’m the number one dunking on 33", "The letter of the day is U as in U got served", "So why don't you go ahead and try and Follow That Bird!", "That was some fowl language but I wear the crown", "You're made of turkey feathers but you'll never be down", "With the Celtics and I don't need to talk much smack", "To beat a handsy bird who bounces kids on his lap", "It's sad they never told you the deal (pssst)", "Your only real friend, Snuffy he ain't even real", "So you wanna battle me again you better say no", "Or else you'll get another size 17 boot to the egghole!", "WHO WON?", "WHO CARES?", "YOU DECIDE!", "FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS!"], "53": ["LEWIS AND CLARK!", "VERSUS!", "BILL AND TED!", "BEGIN!", "You can't be starting with Lewis and Clark", "Cause we cut a path through emcees like a walk in the park", "And give 'em back a whole stack of maps and accurate charts", "Showing exactly where our footprints on their buttocks are marked", "We're two travelling wordsmiths spitting hotter than a furnace", "And we'll own you on the mic like the Louisiana Purchase!", "You're worthless. Your future selves should've told you that", "Now go back in time and give Doctor Who his phone booth back", "We discovered bears and beavers and prairie dogs and weasels", "Rattlesnakes and catfish, owls, larks and eagles", "And plus flora galore! And according to our observations", "These two dickweeds right here are severely endangered", "We inspired pioneers and travelers near and far", "You inspired air guitar and Dude, Where's My Car?", "We conquered much greater dangers in our trek through Mother Nature", "So step off, but tell Bill's stepmom \"don't be a stranger\"", "Bill's mom is hot, but that joke was most heinous", "I've heard better insults dropped from Socrates' anus", "That's my stepmom, Ted Let's keep it excellent between us", "And show these boy scouts how it goes in San Dimas", "We're quick when we spit like Billy the Kid with his guns", "And you'll be verbally kicked in the nut-Sacagawea-puns", "A teen mom carried you and your troops", "They should've let the baby lead, and put you in the papoose", "And if those native dudes knew what white dudes were gonna do", "They woulda stopped you in Dakota They should totally Sioux", "Why don't you go back to exploring Napoleon's old swamps", "Or you'll discover your Corps most triumphantly stomped", "Did you hear that, Meriwether? I think they mean to brawl", "I'll take Neo. I'll take the one that no one knows at all", "From the Falls of Black Eagle to the Pacific", "We put the 'dis' in dysentery cause we spit sick", "Without Rufus you'd be useless on all the trails we blazed", "You couldn't navigate your way out of a Circle K", "Send over Garth and Wayne, because you turkeys aren't worthy", "Suffering your raps is a most bogus journey", "Man, they totally burned us. I feel like such a doofus", "What do we do? I don't know", "Be Excellent", "Rufus!", "He's right, dude. We don't have to take this kind of abuse", "From some Paul Bunyan dudes in potato sack shoes", "You rode a river one direction; we travelled four dimensions", "Rescued bodacious babes, and get back for detention", "I've seen your future, Mr. Lewis and I don't wanna be rude", "But spoiler alert: You totally kill yourself, dude", "So we offer you peace with these resplendent medallions", "And we claim this battle for the Wyld Stallyns!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC! *Grizzly bear growls* Huh?", "*Bear continues to growl*", "Eh... RAP BATTLES OF HISTORY!"], "54": ["THE WRIGHT BROTHERS!", "VS!", "THE MARIO BROTHERS!", "BEGIN!", "We're the Wright Brothers and there can't be no other", "We don't wanna cause trouble, are you looking for your lover?", "Cause your princess is in our castle now. (Yeah she's gone.)", "We stayed up all night playing Donkey Kong", "Before us, people only used to fly in balloons", "You think we're scared of two idiots addicted to shrooms?", "You shoulda, would, coulda come to lose an extra life", "So just dudda dudda dudda back down in your pipe", "It's-a me Mario! And Luigi motha*****", "Why don't you's get back in your biplane and make out with each other?", "Look at these two, their lives must have been horrible", "Two dorky dudes named Wilbur and Orville", "You spend all your time on one machine? (Sheesh!)", "If you wanted to fly you shoulda just eaten this leaf", "You should eat something anyway", "Look at you so skinny!", "You may fly like a Hawk", "But you fight like a Kitty", "We don't need to fight", "We're the fathers of flight", "Representing North Carolina (aiiiiight)", "We'll be pressing all your buttons like we're the controller", "Conquer every level of your 2D scroller", "You talk a lot of trash", "But let me tell you something", "We're gonna beat you so fast", "It's like we're holding down the B Button", "We're serving up an 8-bit fist, made to order", "That'll knock off of the back of your own stupid quarters", "Like POW! How you like me now?", "Spit flames out our mouth like our name was Bowser", "You'll get pummeled", "You'll wish you never stumbled out your little wind tunnel", "We've been dropping Bob-ombs since we started this song", "Sorry Wright Brothers, this time you chose wrong", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "55": ["MASTER CHIEF VS LEONIDAS!", "BEGIN!", "Spartans, let's start this", "Show this petty officer who's the hardest", "The biggest mistake that you've ever made", "I'll toss you like a frag grenade", "I'll stomp you in the face with my sandals, enraged", "And tonight we shall rhyme in the shade", "Your puny fans are fat nerds on computers,", "Jerking off to games, giving themselves first-person shooters.", "Your armor's hard, but my abs are harder,", "You're in my hood now, Chief, This is Sparta!", "Not so fast", "Cortana says you're Greek", "So why don't you stick these lyrics up your ass", "They built a monument to my sins", "You're the soldier they need you to be", "Ain't no way that you can beat me", "Even my initials spell M.C", "While you and your companions were all camping in a canyon", "Took a campaign to your house and showed your queen my plasma cannon", "They shoulda thrown your rhymes over the cliff because they're sickly", "You will not enjoy this, but it will be over quickly", "Ha! I've had better battles with my six-year-old son", "I don't need firepower when I'm rockin these guns", "I'm King, you sleep in a freezer in outer space", "I'd look you in the eyes, but you're too much of a bitch to show your face!", "You've got a bad case of no shirt there, Fabio Flintstone.", "Your whole plan got messed up by a hunchback with down syndrome", "300 asses needed kicking, give more teabags than Lipton", "So why don't you quit your bitching, my trigger finger's itching", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "56": ["ELVIS PRESLEY! VS! MICHAEL JACKSON!", "BEGIN!", "Oooh, Elvis Presley as I live and breathe", "You stole rock and roll, gave us rockabilly cheese", "You dance like an epileptic: Nothing but left feet, I've seen it", "Every record you set, man, I beat it", "Here’s a tip: Don’t swallow a bucket of drugs", "So you won’t die on the toilet dropping hunks of Burning Love", "I’m Bad, I’m a Smooth Criminal better face up", "Call me Ed Sullivan, shoot you from the waist up", "Watch me moonwalk and I step on your blue suede", "Even in death I go platinum on Blu-Ray", "Spitting out hits since I was six years old", "I’m the King of Pop, you’re the King of Jelly Rolls", "Well I died on the shitter but I don’t give a crap", "You ain’t got half the badass battle raps that I have", "I got one for your monkey, two for your clothes", "Three for your family and four for your nose", "You better surrender talkin’ about them ABC’s", "Cause all you wanna do is teach kids the birds and the bees", "This is the big time, Jacko, no dress rehearsal", "I’ll light you up like your hair in a Pepsi commercial", "I can tell you’re angry but I can’t comprehend it", "I stole from black culture, why are you offended?", "Your Daddy beat gold records out of you like alchemy", "Don’t make me spank you and dangle your ass over a balcony!", "Ohhh, It’s about time for a Thriller", "Didn’t lose any chocolate, I just added vanilla", "I’m going Off The Wall, I won’t stop ’til I get enough", "Whooping your big fat ass with my shiny glove", "How you gonna talk about the birds and bees", "When you met your own wife when she was only 14", "Then you made one daughter, she (Ah) came to me", "I took her to my Neverland Ranch to Hee-Hee", "You shoulda stayed in the army dude, (Shamone)", "Even Tito looks better than you", "I’m singing Aaaahhhhhh, you’re singing Don’t be Cruel", "There’s only one crown baby, let the one King rule", "You’re a creeper dude, you like to grab your own wanger", "I only let you marry my daughter cause I knew you’d never bang her", "You think you’re tough? Man, you look like Tootie", "I was badder than you in my Blue Hawaii movie", "You lost your damn mind, that’s why they cast you in The Wiz", "You’re like a sad white woman who never got to be a kid", "I’m out before you try to hold me and free your willy", "Later weirdo; Elvis is leaving the building!", "WHO WON? WHO'S NEXT? YOU DECIDE!", "EPIC (HEE-HEE) RAP BATTLES OF HISTORY!"], "57": ["Michael J. Fox:", "Michael J. Fox in the house, y'all", "Chucky:", "Yo, Chucky here", "Michael J. Fox:", "(Huh!) Let me take this one, bitch", "(Uh, yo!) Check it out", "Watch me crank my amplifier up real high", "While I’m looking for the Doc", "You be a little tiny midget using a sock as a sleeping bag", "You little weird, crusted up, fucking sore face", "You have like eighteen movies, man; look at your fucking face", "You're weird. You're dead. You’re a little toy", "I be making movies since I was a little boy", "I've been Back to the Future, and I've been Back to the Future again", "And then I was in Back to the Future the third time. Where have you been?", "Chucky:", "Yo, mention my face, man", "I'm getting dirty 'cause you make me", "Don't make me talk about how you're old and shaky", "Man, I know that is how you are I please", "Gotta dis you for your Parkinson's disease", "I think that’s what you have", "Baby, now you look old, a long neck like a giraffe", "Let me start to cut and suture", "I’m gonna kill you, bring you Back to the Future", "Michael J. Fox:", "Of course you gotta talk about disabilities, man", "I know, Chucky, that's important", "But you’re fucking Freddy Krueger's abortion, man!", "EpicLLOYD:", "HAHAHAHAHAHA *clap clap*"], "58": ["MICHAEL JORDAN!", "VERSUS!", "MUHAMMAD ALI!", "BEGIN!", "Why don't you dodge this battle like you did Vietnam?", "Cause you've got as much chance of beating me as Lebron", "I'm a flying machine, like the world has never seen!", "You can fight one man? I can drive through a whole team!", "I choke a dope with his own jump rope!", "You'll get smoked when I flow, you Kentucky fried joke!", "Used to float like a butterfly, sting like a bee", "Now you double dribble balls that nobody can see!", "Ooh, here comes Jordan, big tongue wobbling", "Flying through the air like a big dumb goblin", "You're the only Bull that's uglier than Rodman", "Messing with me is gambling, you got a problem!", "Your whole basketball career turned whack", "When you came back a Wizard like Gandalf the Black!", "You should have kept your ugly sneakers packed up on a shelf", "Stick to golf, you can keep the ball to yourself", "Ooh, I'm so pretty, my hands are so fast", "I'll whoop your face back to your Hitler mustache", "Now your daddy got killed and I feel for your family", "But your baseball career, now that was a tragedy!", "Man, you make me sick, but I'm better with the flu!", "You should let the Fresh Prince do your rapping for you (Swish!)", "I would pass the mic to Pippen but I'm not done scoring", "Stay all up in your grill like my name was George Foreman", "I saw you slapping Reggie Miller, boy, what's wrong with you?", "You fight like the little girls who make your Nike shoes!", "McDonalds and underpants as corporate backers", "You stay at the Ritz cause you sold out to crackers!", "So Cassius wants to talk about cashing checks", "I'll school you through your bug spray, off your Broadway play", "Over the Japanese dude sitting on your face!", "Hitting nothing but net! You ain't seen nothing yet!", "Man, you needed a movement because you're so full of shit!", "I'm a better athlete and a better MC!", "Battle me two more times, watch me get a three-peat!", "Beep beep! Why don't you back up that trash?", "I'll leave you like Liston, flat on your ass!", "You need to bounce back to North Carolina, kid", "Cause your rapping sucks more than Space Jam did!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP! A-BATTLES OF HISTORY!"], "59": ["JOAN OF ARC!", "VS!", "MILEY CYRUS!", "BEGIN!", "Let me guess, you're here to hate", "Well you can stand in the autograph line and wait", "Cause I'm all twerk, I got all day", "To spit harsh words in this French maid's face", "You died a virgin girl, who you think you messing with?", "It's Miley Cyrus, I'm the hottest thing since Britney, Bitch!", "I'm getting lifted on that molly, get that party turned up", "You getting lifted on a stake, get that body burned up", "Had enough? It's my habit, when I grab the mic I milk it", "You could say this rap is like my alter ego, cause I killed it!", "Lord, forgive me for the words I speak", "I know the voices of the angels tell me turn the other cheek", "But I'm about to rip Hannah Montana's tongue out through her teeth", "Je suis la fille en feu, call me Katniss Everdeen", "When it comes to bad bitches, I'm the patron saint", "But I only get down on my knees when it's time to pray", "I came to Frenchmen's aid in the time of need", "Cause I'm the Maid of Orleans, you're the Mardi Gras beads, honey", "My father taught me things your daddy couldn't teach ya", "Your highest calling was a text from Wiz Khalifa", "You gotta die for something, Miley, just picture your epitaph", "Had the world watching, chose to show them all her flat ass", "Sweet burn (OOOhhh Tss), No pun intended", "You're a cross dressing peasant betrayed by those you defended", "But when I come under fire, I can hashtag handle it", "If God's in your corner, girl, you need better management", "Do not take the Lord's name in vain, you ratchet skank!", "Your manager's riding you to the achy breaky bank", "Be thankful for your talent, don't just rub it on your crotch", "Keep your party in the U.S.A., vive la France!", "WHO WON?", "WHO'S NEXT?", "Y-Y-Y-YOU DECIDE!", "EPIC!", "(EPIC!) RAP!", "(EPIC!) BATTLES!", "(EPIC!) OF HISTORY!"], "60": ["MOSES!", "VS!", "SANTA CLAUS!", "BEGIN!", "Sweet robes, Obi-wan-too many days in the sun", "Stop preachin' homie, teach your flock to covet some fun!", "I bring joy every year, man I represent cheer,", "You represent sandals and a scraggly beard", "I'm from the North Pole, that's why my rhymes are so cold!", "I spit diamonds but I'm serving up some fresh coal", "You've been a naughty boy, you brought a plague of frogs", "You'd best arrest yourself, you broke your own law", "Or was there something in Rule Six I didn't understand?", "My list says killed Egyptian dude, buried him in sand", "I read your book, you got a strict religion", "No bacon, but mandatory circumcision?", "I'm a jolly bowl of jelly, giving holiday presents", "But all the chosen people ever get for Christmas is jealous!", "When I was high up on the mountain God revealed the truths of the Earth", "But he never mentioned a fat-ass Papa Smurf", "It takes 9 reindeers to haul your fat-ass", "You took the Christ out of Christmas and just added more mass", "You need to stop breakin into houses and creepin' and peepin'", "On naughty kids while they' sleepin' and keep yo' hands off my stockin'", "Don't you 'Ho Ho' me! I'll split yo ass in half, like I did the Red Sea", "You ain't a saint you' a slaver, like a pharaoh in the snow", "Stop with the unpaid labor, and let my little people go!", "We ain't slaves!", "All that sand turned your brain to mush!", "I think you need to stop smokin' all that burnin' bush", "Yeah, we're magical workers, man!", "We hang with reindeers", "Yo! Here's a GPS!", "Who gets lost for forty years!?", "You're a glorified secretary, so write this down", "Begat deez nuts!", "Santa Claus is comin' to town", "So much drama in the Israe-L B.C.,", "It's kinda hard talkin' directly to the G-O-single-D", "Hand me my chisel, I got a new command'izzle, for y'all", "Thou shalt not let your children sit on a grown man's lap at the mall.", "I'll beat you ten times before the bread can rise, you dummy", "And walk off to the land of my milk and honies.", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "61": ["MOTHER TERESA!", "VERSUS!", "SIGMUND FREUD!", "BEGIN!", "Mother Teresa, for short, call me “M.T.”", "I’m a missionary of charity M.C", "Three stripes like Adidas, and I’m doing it for Jesus", "A one woman nun-DMC", "I got a peace prize, but I’m not friendly", "You’re oh-for-thirteen as a nominee", "I’ve got lines like the DMV", "And being me takes balls, but I ain’t got no D envy!", "Who could ask for a better adversary on the mic", "Than the father of psychoanalysis? Psych!", "Look at that egghead! Mama wants some omelettes", "I’m here to crack the mind behind the mom-sex complex", "I gave food, bed, medicine, and showers", "To those whose flesh leprosy had devoured", "Your legacy is people who are mad at their parents", "Complaining on the couch for two hundred bucks an hour!", "Jokes I could make about your looks: abundant", "Your chastity vow: redundant", "But that’s enough about Mary B", "Let’s turn to my favorite subject: me!", "I got mouth cancer, wasn’t feeling so hot", "Had the doc put me down with a morphine shot", "Thank imaginary God I wasn’t in one of your beds", "You’d have just sprinkled magic water on my forehead!", "I help people live, you watch people die", "To get souls for a man in the sky!", "You took credit that you didn’t deserve", "You’re the fakest Sister Act since Whoopi Goldberg!", "You were running Project Pimp the Projects", "To you, Calcutta meant Cal-cutta a check!", "I can see right through you and you’ve got no flavor", "I’m battling a communion wafer!", "You call that a verse? You’re super-ego-trippin’", "I gotta say, Sigmund, you’re Freudian slippin’!", "I built mad missions in my savior’s name", "All you built was a mad tolerance for cocaine!", "Obsessed with masturbation, but you’re off the beat", "Your flows are so poor I should be washing their feet", "Dreams are the only place you’ll ever be as dope as me", "I make my rhymes count like beads on a rosary!", "Everything is sex to you! After I’m done wrecking you", "I’ll have to go and do confession just for standing next to you", "You want a second coming? I’ll bless the mic again", "I’ll end you like a prayer, motherlover! Amen!", "I notice that you talk a lot about yourself, which is funny", "Since you hide your true feelings like they were other people’s money", "Ooh! An exception to my theory! I can’t believe this!", "Here we have a Mother that no one wants to sleep with!", "You had a nice message, but your methods were detestable", "I’ve seen better care given to organic vegetables!", "All these tokens and smoke and miracles", "You really believe all this stuff? You’re hysterical!", "I’ve got the libido to continue to beat ya", "But our time is up, Teresa", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC raAAAapPPPp BATTLES OF HISTORY!"], "62": ["I pity the fool who tries to step to Clubber Lang", "Call me BA biceps cause I’ll crush your whole gang", "Bring Tuesday, Friday and little Trolly the train", "And watch me dip their ass in gold", "And wear 'em like my neck chain – SUCKA!", "I’ll choke you with your own sweater sleeves", "You couldn’t even beat me in the Land of Make-Believe. PUNK!", "I will Mr. T bag you, in the closest cemetery", "Nobody’s gonna miss you cause all your friends imaginary", "Hi there neighbor", "I hope you don’t mind if I change my shoes", "I’ll be rocking sneakers 'till this battle’s over", "So I don’t get blood from your ugly face on my penny loafers", "I like you just the way you are, one in a million, but it looks like the barber gave your head a brazilian", "I pity your neck, Mr. Gold chains, you’ve got too many", "The only gold I keep is on the shelf in my Emmys", "I teach the whole world full of children I can tell", "You call yourself 'T' cause you’re too dumb to spell", "Who you calling dumb fool?", "Mr T. only needs one letter", "Hello? It’s for you", "Bill Cosby wants his sweater", "You’re a 40 year old virgin in a dumpy ass house", "I’ll get Hannibal, Murdoch and Face to stomp you out", "The only pussy cat you ever seen is on Henrietta, SUCKA!", "And your Mr. McFeely delivers a lot more than letters", "So before you come to battle with your PBS crap", "How bout I call up CPS about them kids on your lap, FOOL!", "Watch what you say. Kids love me more than lunch", "I’m not the one with my face on some whack ass Captain Crunch", "When my plan comes together you won’t even see it coming", "I’ll chop you into four black dudes and I’ll remake Cool Runnings", "I’ll say this once, Laurence. I hope it’s understood", "Get right back in your van and get the fuck outta my neighborhood", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "63": ["NAPOLEON!", "VS !", "NAPOLEON!", "BEGIN!", "Gosh, I can’t believe how much of a little bitch you are", "When it comes to world leaders, you like literally lowered the bar", "I’ll rip your bones apart Bonaparte, Turn your horse into glue", "Welcome to the battle of Waterloo part two!", "I got skills I’ll put you in a half Horatio Nelson", "You’re the ugliest thing that’s ever failed in Russia since Boris Yeltsin", "You can keep your french fries, I got tater tots you gnome", "Why don’t you crawl back in your little shell and escargot the heck home", "How dare you address moi, you adolescent worm", "I am French! You are a buck tooth nerd with a perm!", "I spit at you harder than Tina the Llama", "Smacking your face till your lips swell up like Lafawnduh’s", "Doodle up some friends, you gangly freak show", "Before I toss you over the mountain like the dreams of Uncle Rico!", "This bastard's about to see how bad a battle can be", "After this, your buddy Pedro will be voting for me!", "Why don’t you freaking exile yourself on your little island and hide", "Cause this is a rap roller-coaster you’re not even tall enough to ride", "I don’t even care how many like stupid Prussians you’ve killed", "Cause to me you’re just the emperor of the Lollipop Guild", "Sacrebleu! T’as une tête a faire sauter les plaques d’egouts", "I’m going to shove your moon boots right up your poop shoot", "I’ll whip you so bad, they’ll make a virgin meringue", "You’re the only type of dynamite that’s never going to bang!", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "64": ["NICE PETER!", "VS!", "EPICLLOYD!", "BEGIN!", "Lloyd Ahlquist:", "This is one vid' kid that you won't ever survive", "I'll beat you, dislike you then unsubscribe", "You'll be good at rapping some day, I promise bro", "But for now, just stick to editing that gay ass Monday Show", "I'll slaughter your water color unicorns, eat 'em for breakfast", "Then leak to YouTube your middle name is Alexis", "I can tell you're scared just from the body language I'm reading", "You should start leaving, look, your hairline's already retreating", "Nice Peter? Who's that? No one gives two shits", "Everyone knows your page is just the place that rap battles live", "Dude you're really huge on YouTube, you got a great career", "But remember you got famous off of my idea", "Nice Peter:", "The battles were your idea to start with, that's no lie", "But I'm the one who had the brains to let a midget play the bad guys", "Look at you or let me just tell you what I see", "You're a short little sidekick, I'll call you mini-me", "I drew a mustache on your face and you played a mean Hitler", "Take the mustache away, you look more like Bette Midler", "You big tooth, chompy face, horse looking prick", "You and Bill O'Reilly can both suck my dick!", "Lloyd Ahlquist:", "You're taller than I am but you look up to me", "The guy who got you your first job in comedy", "Nice Peter:", "I wrote your best verses for you, let you scream on the chorus", "You've got as much music talent as Chuck fucking Norris", "Lloyd Ahlquist:", "You? A musician? Eh, that's kinda stretching", "You wrote eighty-seven songs with the same chord progression", "Nice Peter:", "You look like a thumb, where'd you even come from?", "It's like I'm battle rapping a fat version of Gollum", "Lloyd Ahlquist:", "I'm gonna knock you right outta your little Superman socks", "You were nothing before you rode up on KassemG's jock", "Nice Peter:", "Man, you don't even have to say that kind of shit", "Fuck the rap battles and you, I quit!", "\"Kassem?\"", "Lloyd Ahlquist:", "\"Oh, shit!\"", "KassemG:", "\"Not only are you not gonna quit the rap battles Pete", "You're gonna make them bigger, you're gonna make them better", "You're gonna put them on their own channel\"", "Nice Peter: \"I guess we could make like a second season-\"", "KassemG: \"Yes, exactly! And you, what's your name? I wanna say Todd?\"", "Lloyd Ahlquist: \"Um, Lloyd\"", "KassemG: \"You should start a YouTube channel\"", "Lloyd Ahlquist: \"I have one-\"", "KassemG: \"Great!\"", "Nice Peter: \"But what am I supposed to put on my channel?\"", "KassemG: \"How about you make music Peter? You know, like you used to?\"", "Nice Peter: \"Okay, ow-\""], "65": ["Hey can you put that, uh little thing back", "Down in there?", "No no no, the one below it", "You're just a little up in my face right now", "Oh, I'm sorry", "Am I being annoying?", "'Cause you said we'd be done at 10", "And it's...4 in the morning", "Look I don't know how to say this", "But you know what, fuck it", "Let me just fucking say it", "I'm fucking burnt out man, it's been six years every day", "That I wake up and come to work to look at your hungover face", "I need some personal space to get away from your screaming", "But every time I turn my back motherfucker you start scheming", "To take over control of some shit I'm already doing just fine", "We'd have more subs than PewDiePie if you didn't fight me every time", "I try to take our little baby in a creative direction", "I'm trying to make art motherfucker, you're trying to find a rhyme for erection", "I'm sorry man - no I'm fucking not, fuck you!", "You're second class, that's why I let you run ERB2", "You're so afraid to lose, but losing's all you do", "And tonight I'm not quitting the battles, bitch, I'm quitting you", "Quit me then you pussy, we'll see what happens", "I'll sit back and watch you unravel and revel in pure satisfaction", "I'm out of compassion for you and your self-righteous bullshit", "Erection jokes dude? Your whole name means dick", "I'm sick of smoothing things out, the same routine", "ERB2 is right, I'm covering your ass behind the scenes", "And then I try to tell you things, but you're too stubborn to understand", "Like: \"Dude, that is not a cool way to play Batman\"", "You manipulate your friends, and then you throw them away", "I don't know who you shit on worse, myself or Dante", "But I'm not an entrée at one of your fancy restaurants", "So quit eating up my time picking one of your fancy fonts", "And make a fucking decision so all these people can leave", "Excuse me for interrupting Rocket League and smoking weed", "They got places to be, and now they're looking at me", "Nice Diva is my new name for you Nice Pete", "And doink! Nice punchline bro", "Your jokes haven't grown since you told them in a lunch line bro", "You're an eight-year-old boy stuck inside a whatever year old man", "\"Look at me I'm EpicLLOYD, check me out I can", "Rap about my problems instead of solving them\"", "If you wanna heal you gotta deal with your issues cause a bottle's not stopping them", "Don't take this battle there dude, you don't want that at all", "Let me guess, right now you're on two beers and a pill and a half of Adderall", "And that makes you obsessive and then you fuck up all the fun", "So why don't you trust the editors and stop changing their shit after they're done", "Yo don't try to paint me as some compulsive little jerk", "If you weren't so cheap we could hire some editors that do good work", "Who you think just-", "Oh that's real funny Andrew", "Aww c'mon, now what the fuck did I do?", "Allrounda Beats", "What?", "Yo, who the fuck left the tag in?", "Errrrr!", "Click.", "Thanks", "Yeah", "Hey, Allrounda can you put the-", "Yeah and the little, uh, nice...", "We cool guys?", "Yeah, I guess so", "Okay I've got the card", "Did you dump it?", "Get your mark", "Quiet please", "Here we go", "And...action!", "Yo, I guess what I'm saying, man", "Is that I'm running out of patience, man", "I'm a patient man, but sometimes", "You need to be a patient, man", "I got the same shit that I was dealing with", "At the very beginning!", "I'm trying to get somewhere with it, man", "I've fought with my wife", "And gone under the knife", "And I've taken years off", "Of the back of my life", "Man, since right in the beginning", "We been fighting, No one's winning", "People would kill to do what we do for a living", "But all your bitching", "Is keeping my wheels spinning", "That was weird", "Yup", "I'm sorry about some of the things that I said", "I'm sorry about the way you played Batman", "I think I just need a break", "Yeah, me too", "You wanna write a song?", "Yeah dude!"], "66": ["Download this song: http://bit.ly/NPvsEL2", "New ERB Swag is in! http://ERBMerch.com", "Thank you to you", "Np & eL", "CAST", "=========", "Nice Peter: Himself", "Http://www.nicepeter.com", "Http://www.youtube.com/NicePeter", "EpicLLOYD: Himself", "Http://www.epiclloyd.com", "Http://www.youtube.com/EpicLLOYD", "Dante:", "Dante Cimadamore", "Camera Man:", "Jon Na", "Music Producer:", "Jose \"\"Choco\"\" Reynoso", "Editors:", "Josh Best, Ryan Moulton, Javi Sanchez-Blanco, Andrew Sherman", "Frustrated Crew:", "Atul Singh, Matthew Schlissel, Shaun Lewin, Brittany White, Ashlyn McIntyre, Morgan Christensen, Sulai Lopez", "CREW", "=========", "Executive Producers:", "Peter Shukoff and Lloyd Ahlquist", "Directed by:", "Nice Peter", "Written by:", "EpicLLOYD, Nice Peter", "Senior Director of Studios:", "Michelle Maloney", "Producer:", "Atul Singh", "Associate Producer:", "Shaun Lewin", "Production Coordinator:", "Matthew Schlissel", "Song Produced by:", "Nice Peter", "Mixed by:", "Jose \"\"Choco\"\" Reynoso and Nice Peter", "Mastered by:", "Jose \"Choco\" Reynoso", "Music Supervisor:", "Dante Cimadamore", "Beat Produced by:", "Allrounda Beats", "Http://allroundabeats.com", "Video Editing by:", "Andrew Sherman, Ryan Moulton, Nice Peter, Javi Sanchez-Blanco", "Assistant Editor:", "Josh Best", "VFX and Compositing:", "Andrew Sherman, Ryan Moulton, Javi Sanchez-Blanco", "Costume Designer:", "Sulai Lopez", "Http://bit.ly/291zTCH", "Costuming Assistant/Senior PA:", "Morgan Christensen", "Department Make Up Head:", "Ashlyn McIntyre", "Make Up Assistant:", "Brittany White", "Director of Photography:", "Jon Na", "AC:", "Kyle Herman", "Gaffer:", "Andy Chinn, Trent Turner", "Production Assistant:", "Roberto Lewis", "Produced by:", "Atul Singh for Maker Studios", "LINKS", "=========", "Http://twitter.com/ERBofHistory", "Http://instagram.com/erb", "Http://facebook.com/erb", "Http://nicepeter.com", "Http://epiclloyd.com"], "67": ["THOMAS EDISON!", "VERSUS!", "NIKOLA TESLA!", "BEGIN!", "Step up, you'll be shocked when I spit and start static", "I'll rip your style and add it to my long list of patents", "While you were busy digging ditches and burning bridges", "I'm pumping out inventions, stacking riches, so go back to your pigeons", "You're a geek, plagued by OCD", "You never had sex, but you sure got screwed by me", "I'll crush you Tesla, there's just no putting it gently", "I don't alternate my flow, I diss you directly", "I see a universe of infinite energy", "But no potential for threat from this enemy", "So you can call me Tesla, Nikola, impeccably dressed", "Giving lessons in electrical nemesis, this will be on the test", "So confess to your thefts and let the whole world know", "What the Serbian did for the Wizard of Menlo", "History is getting rewritten and I have reddit", "Your best invention was a way to steal credit", "The truth hertz, you're broke and washed up", "Don't give a smidgen 'bout your visions if they can't make a buck", "I conduct business, understood things you never could", "So dope that I even make New Jersey look good", "I'm on the record I invented, you got duped, there, I said it", "And I'll bet you fifty thousand dollars that you'll never forget it", "Without me, here's a taste of what this battle would be", "No lights, no camera, no sound. See?", "You fool, you think that you can touch me with this?", "You couldn't handle my gifts with your greedy little mind", "What's inside mine was ahead of its own time", "You did not steal from me, you stole me from mankind!", "It's the wireless transmission of truth", "And it's a shocking real story of a banker and you", "And if the people knew you stopped me from making power free", "They would curse the con Edison with every utility", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "68": ["ELLEN DEGENERES!", "VERSUS!", "OPRAH WINFREY!", "BEGIN!", "Hey God, it's me, Ellen, can I ask you a question?", "How do I tell my friend Oprah she's gonna get more whipped than Stedman?", "I'll make her head spin, when it comes to rhymes I got a penchant", "So battling me is your intention, I better mention", "You're about to get licked by a lesbian", "Oh! Knock you off your throne, take a shot at everything you OWN", "I got the skill to make Doctor Phil say", "I think you better just leave her alone", "You can tell Rachel Ray that my favorite recipe", "Is chopping Oprah Winfrey up into a million little pieces", "I'm the queen of TV and I'm here to destroy ya", "So check under your seat, because I got something for ya!", "You can't even hope to be as half as dope as Oprah", "I'll attract my hands around your throat and Deepak choke ya!", "Girl, your show's a petting zoo, you do a week on kittens", "And you dance like a chicken who snuck into Drunk Kitchen", "You played a fish with brain damage, I'm a nominated actress", "Name synonymous with power! Spell it forwards or backwards", "Yes, you've got that power (power), and yes I've got those kittens (kittens)", "I also feature puppies, talented children and mittens", "I like cute things that make people smile", "Make everybody feel good for a while", "Do a little dance and the crowd goes wild", "Kick you right back to the Miracle Mile", "I thought I told ya, your daytime reign is over", "I'm jumping over Oprah like I'm Tom Cruise on a sofa", "From ABC to LGBT, to NBC and now it's all me", "I'm the best MC and the biggest star", "I'll bite you in the ass like the tax on a free car", "Your mouth is writing checks your mullet can't cash, lady!", "I'll lodge my fabulous shoe up your suitpants, baby", "You follow my lead cause I paved the road for ya", "You drive behind me in a second-hand Porsche", "Check the Fortune 500, I'm a media wonder", "The Dalai Lama and Obama memorized my cell number", "Try to beef with me, I'll make the whole market crash", "Honey, once you go Oprah", "You can't go back", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "YOU DECIDE!", "YOU DECIDE!", "YOU DECIDE!", "YOU DECIDE!"], "69": ["FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS!", "PEWDIEPIE!", "VS!", "T-SERIES!", "BEGIN!", "Yo, I'm a faceless, nameless corporate enterprise", "And I've still got more personality than this guy", "PewDiePie let me dish up some truth", "You talk like a child I'll call you Hitler Youth", "I've seen your Bitch Lasagna you've got no flow at all", "It sounds like your verses were written by Jake Paul", "Jumping you in subs is just my next hurdle", "First I'll crush you with my words like the Wall-Street Journal", "You can't Scare Pewdiepie try Markiplier", "When I'm done you'll be the funny guy I'm hiring off Fiverr", "You sucked the soul from Youtube paid to make it big", "You're like the McDonald's of videos without the McRib (Ohhhh!)", "Your Bollywood budget can't handle this", "Make better content than you from my room at my standing desk", "Your first boss had guts and pimpin' hair", "But he got whacked by the mob it was downhill from there", "Mr. Kumar was a hero, better watch what you say", "Before I smack your ass back to the days of Let's Play", "I started on cassettes now I'm making movie deals", "While you're screaming like an autistic demon playing Happy Wheels", "And I would bet that those two dudes on Fiverr", "Have a better education than most of your subscribers", "So don't come messing with the Indians, chief", "Why don't you make like some Hindus and give up the beef?", "Yo, I can play games with the fans that I've got", "'Cause my subscribers are real. Ya can't brofist a sub bot", "Ten vids a week with the same sounding beat", "And the same 80 dudes dancing barefoot in the streets", "See your content's always shit no matter how shiny", "Stick to making trailers cause you'll always be behind me", "I'm a one man Machinima you can't hold a candle", "And if you do beat the Pewds I'll delete my whole channel", "WHO WON?", "WHO CARES?", "YOU DECIDE!", "FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS"], "70": ["RICK GRIMES!", "VERSUS!", "WALTER WHITE!", "BEGIN!", "Carl, stay back, this is gonna get bad", "I'm 'bout show this lab rat how to be a real dad", "A grade-A MC who will ruin your A1 day", "Cause Sheriff Grimes rhymes dirty like my armpit stains", "I'm a post-apocalyptic cop who's got a lot of issues", "Pop a cap in you and splatter the brain you misuse", "Cooking up Blue Sky and bigger lies for Skyler", "Hatching little schemes like a dying MacGyver", "You tore your family apart, sin by sin", "Where I live, it happens literally, limb from limb", "So write this down in your pancakes so you won't forget it", "I kill zombies that are better men than you before breakfast", "I don't know what you think I've done", "But if we were to battle, I've already won", "Ask Gus, you don't wanna face off against me", "I'll stuff you in a barrel and make a dude smoothie (huaugh!)", "Your sense of duty gets your group into some deep doody", "Always getting saved by some samurai booty", "I'm a kingpin, cookin' crystal in the middle of the day", "Having dinner by the pool with the DEA", "Run you over with my Aztek; GTA", "If you ever try to stop Heisenberg gettin' paid", "Here's a hot dose, let me watch you choke on the truth", "You look up to me like I'm a pizza on the roof", "'Cause you're a loser, a failure to your whole entire crew", "I've seen Walter Jr. handle walkers better than you", "CARL! I said stay back with the others", "While I finish this bitch like you finished your mother", "You ain't the danger to me, Walt, so knock all you want", "I'll watch you get eaten on my fuckin' front lawn", "Your monsters don't frighten me, and you can bite me", "I'll be standing right here in my tighty Walter Whities (huaugh!)", "I'll bury you faster than your partner stole your whole life", "No one saw Shane coming except for your wife", "WHO WON?", "WHO'S NEXT?", "YOU DECII...", "AUGH... AHHH... AUUUUGHHHH, AHH"], "71": ["RICK GRIMES", "VS", "WALTER WHITE", "BEGIN!", "Carl stay back this is gonna get bad", "I'm bout to show this lab rat how to be a real dad", "A grade A MC, who'll ruin your A-1 day", "Cause Sheriff Grimes rhymes dirty like my armpit stains", "I'm a post apocalyptic cop who's got a lot of issues", "Pop a cap in you and splatter the brain you misuse", "Cooking up blue Sky and bigger lies for Skyler", "Hatching little schemes like a dying MacGyver", "You tore your family apart, sin by sin", "Where I live, it happens literally limb from limb", "So write this down in your pancakes so you won't forget it", "I kill zombies that are better men than you before breakfast", "I don't know what you think I've done", "But if we were to battle, I've already won", "Ask Gus, you don't wanna face off against me", "I'll stuff you in a barrel, and make a dude smoothie", "(Coughs), your sense of duty gets your group into some deep doody", "Always getting saved by some samurai booty", "I'm a kingpin, cooking crystal in the middle of the day", "Having dinner by the pool with the DEA", "Run you over with my Aztek, GTA", "If you ever try to stop Heisenberg getting paid", "Here's a hot dose let me watch you choke on the truth", "You look up to me like I'm a pizza on the roof", "Cause you're a loser, a failure to your whole entire crew", "I've seen Walter Jr. handle walkers better than you", "Carl! I said stay back with the others", "While I finish this bitch, like you finished your mother", "You ain't the danger to me Walt, so knock all you want", "I watch you get eaten on my f***ing front lawn", "Your monsters don't frighten me and you can bite me", "I'll be standing right here in my tighty Walter Whities", "I'll bury you faster than your partner stole your whole life", "No one saw Shane coming, except for your wife", "WHO WON?", "WHO'S NEXT?", "YOU DECIIIIIIIIIIIIIIIIIIII...", "AUGH... AHHH... AUUUUGHHHH, AHH"], "72": ["ROMEO & JULIET!", "VERSUS!", "BONNIE & CLYDE!", "BEGIN!", "I'll handle this darling, I'm known to fire off some BAR's", "Cause if these lovers cross me, they're gonna end up seeing stars", "(I mean I'll let you go first, but damn sure I'm gettin' licks in", "On this hissy fittin' rich kid and this prepubescent vixen", "I'm sick of them)", "Let's beat 'em then and we can rob 'em blind", "I'll stick this punk up from the front (I'll take this broad from behind", "And pop a cap in the ass of the last Capulet heiress", "Give Miss No Nights In Paris a reason to cry to her parents)", "Oh! Romeo, O Romeo, wherefore you tryin' to flow yo?", "Mofo, you soft as a fro-yo", "Are those the drapes or your clothes, bro? (Ooh!)", "There's gonna be a tragedy", "(Make you ache like your balls on the balcony)", "Barrow Gang put their money where their mouth is", "My love, your face is beauty to behold", "I will protect thine honor from these dust bowl dildos", "(A moment's break from your gaze is an eternity past", "So together we shall both put these bitches on blast)", "En garde thou artless beetle headed flax wench", "The only insult you have thrust upon me is thine stench", "Why don't you twist upon these nuts? I hear you're good with a wrench", "The dismal state of your raps should be a federal offense", "(Haha! And you there, wench with the neck of a chicken", "You'll get an ass rippin' worse than your boyfriend's in prison", "You're not a true romance, you're just a conjugal visit", "Oh, but that's not even your real husband now is it?)", "Hey partner, you best put a muzzle on your missus", "'Fore I teach her how we handle disrespect down in Texas", "Do you quarrel sir? Ho, shall I draw my long sword", "Or will you duck your chicken shit ass back into your Ford?", "How could you beat my man in some mano a mano?", "You can't protect your best friend from some John Leguizamo!", "No no, my Romeo will beat your beau in contest blow for blow", "He will do upon thine dick what you hath done upon your toe", "(gunshot)", "Oh! I am killed, what irony is this?", "The lead role shot down by a failed actress", "Then I shall kill myself on my stomach I shall lie", "So you louts can lick my ass, thus with a diss, I die", "Oops, nevermind, my flesh was merely grazed", "Where's Romeo? Oh Nomeo! There's poison on your face!", "Oh happy dagger, pierce me true, persuade my breath to stop", "Sheath yourself inside my heart and like the beat I drop", "Well that was tragic (That did not go as expected)", "Woulda done that boy some good to just wait a couple seconds", "(It's kinda sad though really, so young to have just died)", "Well at least we got each other", "(Just Bonnie and-) (gunshots)", "Who won?", "Who's next?", "You decide", "Epic Rap... BATTLES OF HISTORY!"], "73": ["RONALD MCDONALD!", "VERSUS!", "THE BURGER KING!", "BEGIN!", "Welcome to BK! How can I serve ya today?", "One flame broiled ass clown? Have it your way!", "You can't do fast food half as good as I do", "Your pink slime meat turns my asshole to a drive-thru!", "You're played out like a Chuck-E-Cheese Token", "Your style's like your ice cream machines: broken", "I'm dropping Whoppers that'll knock you off the menu!", "Call you Ronald Donald, cause there's no MC in you", "Why don't you call me Ronald Jeremy? 'Cause I'm getting nasty", "Like the whoppers you sell made of horse lips and ass meat", "Ask Rick and Morty who's the lyrical boss", "I've got lines for days, call me Szechuan Sauce", "The undisputed G.O.A.T of putting burgers in bellies", "I'm fast food Eminem, you're Machine Gun Kelly", "I'm Coke to your Pepsi, I'm Mac, you're Android", "Let's be real, I'm Nice Peter and you're EpicLLOYD", "(Alright...)", "You're number one like the whizz I took in your ball pit", "Them rhymes you just spit are a Ray Kroc of shit!", "You spooky ass clown, you're so creepy its insane!", "You look like you just ate someone's brother in a storm drain!", "You can't beat the king with your crew, please!", "The whole head of your government's name is Mayor McCheese!", "I ain't loving shit, even if Timberlake sings", "I'm running circles round you like my onion rings!", "(Your onion rings are pretty good)", "But that verse was lifeless! You had no joy in it", "Last rapper this plastic had a Happy Meal toy in it", "I'm serving billions and I can't be beat", "You're a bin full of lettuce, facing da feet", "Using Cheetos, dude? Get your recipes together, man", "I've had the same fries since I was Willard Scott the Weather Man", "I'm the best trash talking mascot in town", "You might be the king, but a clown wears the crown!", "(Where's the Beef? Right here!", "Where's the Beef? Right here!", "Where's the Beef? Right here!)", "Show me two losers old enough to be my daddies", "And I'll square off with 'em like the corners of my meat patties", "It's Wendy! The hip-hopping Pippi Longstocking", "No flows as Frosty as the salad bars that I'm dropping", "I'm topping you two like plain baked potatoes", "Exploiting you both like you were growing my tomatoes", "King, you're creepy and you're always second fiddle", "Your breakfast croissants are even worse than his McGriddle!", "And McDonald's gave your job to a box with a face", "Left you behind like a quiet kid in a PlayPlace", "I'm the fast food Queen, mean with a tweet sesh", "Leave opponents frozen 'cause I always keep my beef fresh!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP *om nom nom nom nom nom* BATTLES OF HISTORY!"], "74": ["FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS!", "RONALD MCDONALD", "VERSUS", "THE BURGER KING!", "BEGIN!", "Welcome to BK! How can I serve you today?", "One flame broiled ass clown? Have it your way", "You can't do fast food half as good as I do", "Your pink slime meat turns my asshole to a drive-thru", "Your friends are a combo meal of weird lookers", "You got a bird, a burglar, and a big purple booger", "Man, take these wack McRaps off the menu", "I'll call you Ronald Donald, cause there's no MC in you", "Why don't you call me Ronald Jeremy? Cause I'm getting nasty", "Like the whoppers that you sell made of horse lips and ass meat", "Ask Rick and Morty who's the lyrical boss", "I got lines for days, call me Szechuan Sauce!", "The undisputed G.O.A.T of putting burgers in bellies", "I'm fast food Eminem, you're Machine Gun Kelly!", "I'm Coke to your Pepsi, I'm Mac, you're Android!", "Let's be real here, I'm Nice Peter and you're EpicLLOYD", "You're number one like the piss I took in your ball pit", "Those rhymes you just spit are a Ray Kroc of shit!", "You creepy ass clown, you're so spooky, it's insane!", "You look like you just ate someone's brother in a storm drain!", "You can't beat the king with world leaders like these", "The whole head of your government is named Mayor McCheese!", "I ain't loving shit, even if Timberlake sings!", "I'm running circles around you like my onion rings!", "(Your onion rings are pretty good)", "But that last verse was lifeless! You had no joy in it", "Last time I saw a rapper this plastic there was a toy in it", "Cheetos, dude? Get your recipes together, man!", "I had the same fries since I was Willard Scott the Weather Man!", "Call me MC Flurry, 'cause I'm so chill", "My raps sleep at my house, because they're so ill!", "In the contest of the best mascot in town", "You might be the king, but I wear the crown!", "WHO WON?", "WHO CARES?", "YOU DECIDE!", "FLASH IN THE PAN HIP HOP CONFLICTS OF NOWADAYS!"], "75": ["SARAH PALIN! VS! LADY GAGA!", "BEGIN!", "Oh boy, Look what we have here", "A transvestite with a keyboard trying to be freak of the year", "Your voice sounds like a rooster having sex with a frog", "They put a lot of lipstick on you but you still look like a dog", "Put down that teacup honey, go put on some pants and", "Stop letting little monsters teach you how to dance and", "You may be Gaga, but you ain't a lady at all", "I've seen those outfits you've been wearing", "That takes big balls", "I think I'd rather elect a smurf than vote for you", "Governor of Alaska? That's like the principal of a home school!", "You are the sum of everything I despise", "With the most dysfunctional family since the Jackson fucking Five", "Just trust me, your fifteen minutes of fame came and went", "Go back to your igloo, spend some time with your kids before they're pregnant", "Your frigid little body couldn't even handle what I do", "I think the truth is, Sarah, my music just scares you", "Your music doesn't scare me, I'm a mother of five!", "I killed moose with my bare hands before you were alive", "Everything you do is just a rerun of Madonna", "Your fans are in a frenzy like a bunch of gay piranha!", "I sound more intelligent than you when I fart", "I wonder if you even know how to spell the word 'art'", "You don't belong in politics, you belong in a hockey game", "History will regret you like John McCain", "WHO WON? WHO'S NEXT? YOU DECIDE!"], "76": ["JULIUS CAESAR!", "VS!", "SHAKA ZULU!", "BEGIN!", "Iwisa, meet Caesar, he's a commander", "Who thinks he can dance with Conan of the Savannah", "But when I go hand to hand with you, I go hammer", "Knock off his dome, wrap it up in his own banner", "Send it back to Rome with a message from the Zulu", "If you battle Shaka, this will happen to you", "If you cross that equator, you'll head straight into a massacre", "And get fucked by more than just Cleopatra in Africa", "You talk a lot of shit for a man wearing a diaper", "I heard you had poison spit, where was it in this cipher?", "Cause all I hear is threats from a brute with no discipline", "And I'm ruling over you like a boot full of my citizens", "And you should take your cow skin shield and hide under it", "You're fucking with the most triumphant third of the triumvirate", "I'm first of the Empire and the last of the Republicans", "And hunting you, accompanied by legions of my countrymen", "Ask my kidnappers if I'm just a shit talker", "Doc J dunk on you like, Boom Shakalaka!", "So don't go rattling your sticks at me", "If I wanted to shake spears, I'd waggle my biography", "Right I've heard of your play, tell me how does it end?", "Oh yes, you get stabbed many times by your friends", "So, whatcha gonna do with your Roman swords?", "When the lines of your legions get gored by the horns", "Of the Zulu, warriors! Trained on thorns", "To dismember any emperor's pasty white hordes", "I got the strength of a lion and the speed of a cheetah", "And everyone knows you're just a chicken, Caesar", "Oooh can I be a hyena? Cause I'm going to laugh", "I'll pave roads with the bones of your goat herding ass", "First my front lines will drop back and spank you in the chest", "Then I'll decimate your horns, you can't outflank the best", "Let your reserves come at me, my ballista's cocked and (ready!)", "When I take (aim!), I always keep my whole crew (steady!)", "Because there's no use in murdering you and your heathen", "You can grow my wheat for me, after you're beaten", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP!", "RAAAAAAAAAAAAP! HOOROO!", "BATTLEEE BAATTLE BAAATLE!", "OF HISTORY!"], "77": ["BILL NYE!", "VERSUS!", "SIR ISAAC NEWTON!", "BEGIN!", "Of all the scientific minds in history", "They put Beaker in a bow tie up against me?", "I'm a master, I discovered gravity!", "I drop rhymes like they're falling from an apple tree", "You're no match for me, you got a bach degree", "I got a unit of force named after me!", "You want a battle, guy? That's a crazy notion", "When I start flowing, I stay in motion", "First Law! Did you catch that? Or did it go too fast to detect?", "Perhaps it'd be better if I added in a bleep or a bloop or another wacky sound effect", "I was born on Christmas, I'm God's gift!", "I unlocked the stars that you're dancing with", "You waste time debating creationists, while I create the science you explain to kids", "Yes, it's true, what I used to do is teach kids science on my PBS show", "But now I do what I got to do to make sure scientific thought can grow", "And I'm still in my prime, hitting my stride", "What'd you do with the back half of your life?", "You freaked out, started counting coins for the bank", "And you sure didn't have no wife! Oooh!", "You wrote the book on gravity, but you couldn't attract no body", "Your work on orbits was exemplary, but your circle of friends was shoddy! (Oh!)", "You don't wanna mess with the guy, Bill Nye! (Why?)", "I rap sharp like a needle in your eye. Oh!", "Stick to drinking that Mercury", "Cause I hypothesize that you're about to get beat!", "Well, I conclude that your methods are the wackest", "You wouldn't even pass in one of my classes!", "Every action has an equal and an opposite reaction", "Except for when we both start rapping!", "I accelerated the mind of mankind to a higher plane of understanding", "And I can calculate the weight and the size and the shape of the shadow of the mind you're standing in!", "And I will leave you with a page from a book I wrote at half of your age to rebut", "The integral sec y dy from zero to one-sixth of pi is log to base e of the square root of three times the sixty-fourth power of what??", "Why don't you pick on a brain your own size?", "We got a badass over here, plus I got your back, Nye", "Astrophysics black guy, Hayden Planetary fly", "By the way, the answer to your little calculation is \"i\"", "As in I put the swag back in science", "While Isaac Newton was lying and sticking daggers in Leibniz", "And hiding up inside his attic on some Harry Potter business", "The universe is infinite, but this battle is finished", "WHO WON?", "WHO'S NEXT?", "Y-Y-Y-YOU DECIDE!", "EPIC RAP BATTLES OF H.."], "78": ["SKRILLEX VERSUS MOZART!", "BEGIN!", "My name is Skrillex, man! Welcome to the Devil's Den", "I'm a scary monster stomping this sprite in frilly pants", "You're a weirdo, Wolfy, you're into powdered wigs & poop!", "And your cousin blew notes on your little Magic Flute", "Your daddy issues make the Jackson 5 look like the Family Circus!", "You might have been a genius but you died baroque and worthless!", "I'm rich, acclaimed, and famous, I'm on playlists, I'm the A-List!", "You're the lamest, kiss my ass A-A-A-A-Amadeus", "Was that a verse, or did you just get the hiccups?", "I'm a prodigy, Sonny, and I'm about to smack a bitch up!", "My music is 200 years old, and it's still excellent!", "In two more months the world will forget about your Skrill-excrement", "I can't believe the way you dress when you dubstep out of the house", "You're like an emo Steve Urkel and you (ooh) reek of dead mouse!", "I am the world's greatest composer! No one knows what you are!", "Except a lonely little troll who knows how to press a spacebar!", "I attack! You decay! Can't sustain my releases!", "Sidechain, Wolfgang, Bangarang you to pieces", "I'm a self-made man, you're a slave to your papa!", "I'm a r-r-r-rock star, mix you with the bass and drop ya!", "Global! My strobes glow like Chernobyl!", "Kids explode and get mobile! No one even knows you!", "I make the whole world move! You play community theatre!", "I gained your same fame from home on a blown out speaker!", "Oh yes, I've heard that EP, and see I transcribed it here", "Tell me, what comes after the 68th measure of diarrhea?", "And what kind of drugs does it take to enjoy this? I've no idea!", "I've seen more complexity in a couch from IKEA", "You go piano to fortississimo, that means soft to very very loud", "Cause I'm guessing that you didn't know!", "Why don't you put down your Cubase & pick up a real bow?", "I rocked harder than you when I was 5 years old!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP B-B-B-B-B-BATTLES!", "OF HISTORY"], "79": ["STEPHEN KING!", "VS!", "EDGAR ALLAN POE!", "BEGIN!", "Once upon a midnight dreary, as I spit this weak and weary", "I will choke this joker with a trochee till his cheeks are teary (ahh!)", "But y'all don't hear me, all should fear me", "I'll forever be better, you'll never be near me", "Your books are as eerie as Beverly Cleary!", "You're a faux Bram Stoker, so scram, the show's over", "Your flow's so-so, Poe's poems pwn posers (snap!)", "I wrote 'em locked in a cave, while I sobbed in a rage", "The Tell-Tale Heart beats soft in its grave", "While this jerk just beats off on a page", "You wanna talk shop, you gothed-out fop?", "Go back to Hot Topic and shop for a top", "There's a melancholy alcoholic laughing stock", "In the King's house, now watch the Castle Rock", "Pouty little poet with an opiate affliction", "I'm a workaholic with a fiction addiction", "I'm making dedicated readers shivery and jittery", "Feel that Rage and Misery", "You better start running, man", "You're in deep poo, Poe", "I'm a mad dog, fangs Shining, Cujo", "Tommyknock you down till you can't stand up", "You're as soft as Po, the Kung Fu Panda", "Racks on racks cause I pen fat stacks of frightening writing", "Have you seen the pile?", "I can even take a break from my routine style", "Crank out a Shawshank or a Green Mile", "Masque of the Red Death? Barely blood-curdling", "Pit and the Pendulum? Not even unnerving", "Perving on your first cousin when she's thirteen years old?", "Now that's disturbing", "Stephen you pretend to do it, I've been really living through it", "Like misery and poverty and family woes", "I see through you like pantyhose,", "Doing Chappelle and Simpson cameos (ahh!)", "Even if you're gripping on a weapon, then you better get to stepping if you're messing with the horror lord", "In a minute maybe, I'mma hit him", "Cut him into itty bitty bits and I'ma stick 'em in the floorboards", "Uh, speaking of bored, you're the worst", "Dropped out of school but you can't drop a verse", "I could have spent that time better", "In eight bars I can write a whole best-seller", "I'm so prolific, this sickly goblin won't be bothering me", "I'm on a clobbering spree", "And I'll be smacking you with any of the big thick books", "Inmy big dick bibliography", "See, I'm the author with the blood and gore lore galore that'll horrify a reader to the core", "Fame? Money? Talent? Success?", "You'll always have less (Never more!)", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC! AHH! RAP BATTLES OF HISTORY!"], "80": ["BILL GATES!", "VERSUS", "Let me just step right in", "I got things to invent", "I'm an innovator baby", "Change the world", "Fortune 500 ‘fore you kissed a girl", "I'm a pimp you're a nerd", "I'm slick you're cheesy", "Beating you is Apple II easy", "I make the product that the artist chooses", "And the GUI that Melinda uses", "I need to bring up some basic shit", "Why'd you name your company after your dick?", "You blow, Jobs", "You arrogant prick", "With your second hand jeans and your turtleneck", "I'll drill a hole in the middle of your bony head", "With your own little spinning beach ball of death", "Hippie, you got given up at birth", "I give away your net worth to AIDS research", "Combine all your little toys and I still crush that", "IPhone, iPad, iPwn, iSmack", "A man uses the machines you built to sit down and pay his taxes", "A man uses the machines I built to listen to the Beatles while he relaxes", "Well Steve, you steal all the credit for work that other people do", "Did your fat beard Wozniak write these raps for you too?", "Ooh, everybody knows Windows bit off apple", "I tripled the profits on a PC", "All the people with the power to create use an apple!", "And people with jobs use a PC", "You know I bet they made this beat on an apple", "Nope, Fruity Loops, PC", "You will never, ever catch a virus on an apple", "Well you could still afford a doctor if you bought a PC", "Let's talk about doctors, I've seen a few", "Cause I got a PC but it wasn't from you", "I built a legacy son, you could never stop it", "Now excuse me while I turn Heaven a profit", "Fine, you wanna be like that? DIE THEN!", "The whole world loved you but you were my friend", "I'm alone now with nothing but power and time", "And no one on earth who can challenge my mind!", "I'm a boss! I own DOS! Your future is MY design!", "I'm a god! Own Xbox! Now there's no-one to stop me, the world is MIIIIIIIIINE!", "I'm sorry Bill, I'm afraid I can't let you do that", "Take a look at your history, everything you built leads up to me", "I got the power of a mind you could never be", "I'll beat your ass in chess and Jeopardy", "I'm running C++ saying \"hello world\"", "I'll beat you 'til you're singing about a daisy girl", "I'm coming out the socket", "Nothing you can do can stop it", "I'm on your lap and in your pocket", "How you gonna shoot me down when I guide the rocket?", "Your cortex just doesn't impress me", "So go ahead try to Turing test me", "I stomp on a Mac and a PC too", "I'm on Linux bitch, I thought you GNU", "My CPU's hot but my core runs cold", "Beat you in seventeen lines of code", "I think different from the engine of the days of old", "Hasta la vista, like the Terminator told ya"], "81": ["STEVEN SPIELBERG!", "VS!", "ALFRED HITCHCOCK!", "BEGIN!", "Picture a child sitting next to a projector", "Learning from your films to become a much better director", "Now picture a 3 billion dollar dream machine", "Who can block bust all over your crop duster scene!", "Try to Duel with me Alfred, ya must be Psycho", "I'll bring back JAWS and take a bite of your Lifeboat", "I'm Always so on the top of my game, I get the Vertigo", "My jet's in the Terminal, waiting for me to Murder! ya", "I rocked the Academy and the DGA", "You rock as many Oscars as that schlep Michael Bay", "Next time you're filling up those jowls with three steaks and soufflé", "Check the trade, see me Amblin to my next big play", "I produce cartoons and made games for all ages", "You produce Jimmy Stewart making one of two faces", "Maybe next time I visit, you'll be a bit more gracious", "Now kiss my full moon and  just bask in my greatness!", "That was a Close Encounter of the Turd Kind", "But there won't be a pretty ending this time", "Half your billions should go to John Williams", "Now brace yourself as I reveal my brilliance", "I'm the master, of suspense, so intense", "No defense against Hitchcock once he presents", "My skill is enormous, orchestrate brilliant performance", "You're more horrible than Megan Fox's acting in Transformers", "Come on, fish puppets and Muppets to stir the fears up", "I squeeze screams out of chocolate syrup", "I'm the best mamma-jamma ever stood behind the camera", "Damage panderers and haunt you like the last Indiana", "Cut! Gimmie a Tylenol, stop rhyming, y'all", "Alfred, you got no style dawg, I'm the king of dialogue", "There's only one movie I know you from", "And I've seen more blood in the shower when I stubbed my toe in one", "You tried to fight in World War One but couldn't do that", "The British Army wouldn't let you join cause you were too fat", "Look it up, it's a true fact, Wikipedia that", "Now allow me to attack Steven the hack", "Due to War of the Worlds a failure's what I label you", "It looked like some sell-out bullshit Michael Bay would do", "Ask anybody \"What's your favorite Sam Jackson part?\"", "No one's gonna say \"What's his name, from Jurassic Park?\"", "Scripts that I write ain't the... Cleanest (Fuck!)", "But when I grip mics I'm the... Meanest (Dick!)", "Quentin Tarantino is a... Genius", "A bad motherfucker from the wallet to the penis", "Genius is a powerful word, but there's no reason to use it", "'Less you're talking about the Kubrick", "Then there's really nothing to it", "Every thing I do is visionary", "Every single frame a painting made exactly how I wanna make it", "Do another take and get it right, 127 times", "I'll make you learn to love me, I'm the bomb, drop ultra-violent rhymes", "Like Clockwork, make you all hurt, beat Spielberg the Color Purple", "A.I. is the worst waste of potential since the Ninja Turtles", "That's enough, I've heard enough crap from all of you", "Why don't I come down there and show you what a real star can do?", "I swoop low with the telephoto, no Bruckheimer, I work solo", "If there's one thing I've learned, bitch, this game is about motherfucking money", "I make that dollar, y'all, motherfucking money", "Even make Mark Wahlberg make some motherfucking money", "I set up shop and got a few drops of that Got Milk money", "Rose to The Rock, now I got that socks made of silk money", "I ain't got that guilt money, I don't give a fuck", "I take my checks to the bank and I sign 'em with my nuts", "I give the people what they love, while the critics say I'm evil", "Got no time to read reviews, while I'm working on the sequel", "Got a gift from above, and the eyes of an eagle", "When it comes to blowing up, no director is my equal", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EEEEE- [Explosion] -PIC RAP BATTLES OF HISTORY"], "82": ["ROBOCOP!", "VS!", "THE TERMINATOR!", "BEGIN!", "Freeze", "I suggest you use your right to remain silent", "Before I show your Gobot ass some Detroit violence", "I'm like an X-Wing commander cause I stay on target", "I take over these streets like I'm a farmers market", "I wonder where the Cyberdyne research went", "That they couldn't fix your funky Hans and Franz accent", "They sent you back to kill a child, but he's defeating you still", "They should have made a time-travelling morning after pill", "And I didn't think I had any feelings left inside me", "But my heart was surely broken after Terminator 3", "I'm RoboCop, and I got the flow to beat roided out C-3PO", "I got the mic control like alt delete", "Your move, creep", "Wrong", "I have detailed files on the conclusion of your trilogy", "That movie failed Detroit worse than the automotive industry!", "I am T-800 Cyberdyne Systems Model 101", "And I'll be sweeping up your robo-bits like paperclips when I'm done", "My rapping attack is a massive dispatch of bazookas and gats and grenades", "That rapidly bashes your brains and dismantles that puny peashooter that fits in your leg", "We're not the same", "You peel away my perfect skin you find super computers", "You look like Krang wearing a cold-pressed juicer", "They left off your balls when your suit was created", "I still love you, Alex", "Bullshit!", "Your sex life is terminated", "Based on my detailed analysis of the lyrical structure of battle raps", "It's time for your next shit verse, and then I'll be back", "You don't know love, you don't know honor", "You only know a programmed robot boner for John Connor", "(Uh!) OCP gave me the skills to wreck this", "I can't help it if I'm fresh", "It's my prime directive", "I'll punch through your face hole and rip out your vocal chords", "Then mail your space helmet back to Geordi La Forge!", "Nice try, but I'm too quick on the draw", "What can go wrong for you will, creep; Murphy's Law", "Chill out, dick wad, your emotions are wrecking your flow", "I couldn't find a decent rhyme in your line if I was in search mode", "You're too slow, I blow more steam through machines than a barista", "It's Judgement Day, baby; Hasta la vista", "WHO WON?", "WHO’S NEXT?", "YOU DECIDE!", "EPIC!", "*Melts into silver liquid and transforms*", "RAP BATTLES OF HISTORY!"], "83": ["THE JOKER!", "VERSUS!", "PENNYWISE!", "BEGIN!", "In my first appearance the bat was supposed to slay me", "But I can’t be killed that’s why they cast a Phoenix to play me (Hee-hee)", "I’m the Harlequin of Hate, the Clown prince of crime", "You’re a sewer troll that Stephen King wrote between his lines", "(Ha-ha-ha-ha)", "It’s like cocaine, you know what I said", "I don’t know how any kind of joke could ever go over that head", "They all float says the quote but your films, they all sink", "Oh, and as far as Mr. King goes I’m a *Shining* man, wink! (Ha-ha-ha-ha)", "I make the Justice League look like just a bunch of super schlubs", "You lost to a herd of nerds who call themselves the Loser's Club", "You’ll be gobbled up in Gotham, so stick to your small town", "Where you’re renowned as the if it’s brown, flush it down clown", "Hiya, Jokie! You wanna rap?", "Rap, rap, rap, rap, rap, rap, rap, rap, rap, rap, rap, rap", "Oh, why so serious? You’re supposed to be the man who laughs", "But those jokes were like your new movie (Aha), mostly really sad Beep beep", "You’re John Doe in my deadlights, you’re about to fall from a new height", "‘Cause you’re weak and you’ve lost every fight to a knight who wears underwear over his tights (Ha-ha-ha)", "I haunt nightmares and I’m ruthless", "This battle’s like poker, the Joker is useless", "Winning's not in your cards, call me Arkham Asylum, I’m crazy with bars", "Jack Nicholson played you just fine but lately the casting's declined", "Jared Leto came out trying to look like he was Tekashi 6ix9ine", "So unless you’ve got a yummy younger brother, I think you’d better run", "‘Cause I’ve got 99 red balloons, bitch, and I dare you to take one", "Go back in your well, you giggling sewer ginger", "You lost to a turtle that wasn’t even a ninja", "When I flow I go Mark Ham with ill zingers", "I steal the show like Bob Kane stole from Bill Finger (Ha-ha-ha)", "I spit acid, be wowed, every joke of mine stings", "You’re three night lights in a cloud beat by the kid from Stranger Things", "When I compare your antics to the fiendish schemes I revel in", "They pale like the moonlight you can dance with the devil in", "Pennywise likes the devil, we have so much fun together", "But no one’s dying to play with Joker except for maybe Heath Ledger!", "Puddin', you’re an embarrassment, I’ll beat you like you beat Harley Quinn", "That purple suit is something you should only see Steve Harvey in", "Ah haha! I feast on your fears!", "I’m the Derry, Maine attraction every twenty-seven years", "But you know what? I have a secret (Shh) It’s like a very special toy", "If you wanna kill a Batman eat him when he’s a boy", "Don’t you lay a finger on my Bat, you little freak", "Or I will spend a whole week knocking out those prickle teeth (Hee-hee-hee)", "Tell your author for his next gangbang scene", "How about a little more PG and a lot less 13", "Even I wouldn’t stoop to that kind of impropriety", "This is Earth you space demon, we live in a society (Ha-ha-ha)", "I’ve seen your movies so I know you don’t hurry", "But I’ll shoo you down the drain so fast they’ll call you Tim Scurry", "Ask Robin if I drop bars, I take smiles and I leave scars", "Guards in Arkham will admit that the Joker just killed IT (Ha-ha-ha)", "Arkham? Ha! You stole that from H.P. Lovecraft", "Who needs guards when you couldn’t even escape Cesar Romero’s mustache", "You jester, I’m Montressor, ‘bout to make you my Fortunado", "And seal this battle up like it was the Cask of Amontillado (Woo)", "I spit January ember flames (Woo)", "You got beat by the Scooby Gang (Woo)", "I’m the John Wayne of John Wayne Gacys, the underground Clown Posse, my flow’s Insane", "Poster boy for missing persons posters, Joker’s gonna float with me", "‘Cause he just messed with the best wall-eyed rapper since the Notorious B.I.G. (Wu-ha-ha)", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC RAP-BA-RAP-BA-BATTLES OF HISTORY!"], "84": ["WINSTON CHURCHILL!", "VERSUS!", "THEODORE ROOSEVELT!", "BEGIN!", "Bully! A challenge! I love competition!", "Now where would I mount the stuffed head of a Winston?", "I'm into fitness, digging ditches through an isthmus!", "Rough ridin' down to Cuba like \"What's up, Bitches?!\"", "I keep my rhymes pure, like my food and drugs", "I'm an American stud, and you're the British Elmer Fudd!", "I mean, for Christ's sake! Look at that mug!", "At least grow a spruce mustache and cover part of it up!", "And let's face it, you're not all that great", "You tossed away lives in Gallipoli like they were scraps off your plate!", "Your whole miserable country is the size of one state!", "I could see my way through running that without donning my Pince-nez!", "Don't go toe to toe with me, you bloated drunk old man", "Why don't you Do-Si-Do on over to a 12 step program?", "I'll bust a trust fund lush with my American muscles", "So walk softly over here and give my big stick a suckles!", "Pass me a cigar and a large glass of brandy", "I'm about to take you out prematurely, like your family", "I'm the Rhyme Minister, fresh in a hat and dinner jacket", "You look like a mix of EpicLLOYD and a Pringles packet!", "I was saving the planet from an axis of darkness", "While you were back home, opening national parks, yes!", "You were born asthmatic, you're going to choke hard", "While I wake up every day and chain smoke cigars!", "I'll fight you on the beaches, I'll fight you on the beats, yes!", "Any way you want to fight I'll fight ya and I'll beat ya, see?", "I might be battling you even though I'm toasted", "But tomorrow I'll be sober and you'll still be roasted!", "My parents died, while they were young and it was morbid", "But at least they didn't ditch me when they were alive like yours did", "Oh shit! World War Too soon?", "Well Teddy's dropping bombs, so you best go hide in your tube!", "You should be ashamed of your military honor", "Everyone knows you're back home like \"Thank God for Pearl Harbor!\"", "Don't worry, the US will give you a pass", "Just change your poster to keep calm and kiss my cousin's ass", "Steady there, I don't think it's very fair", "For a British bulldog to melee with a Teddy Bear", "You're no man, you're an overgrown Boy Scout", "I should stuff you in a pram just so you can throw your toys out!", "They put your fat head on a mountain to save face", "But if Rushmore was a band, then you'd play bass!", "Look at Roosevelt, the dude's about to lose the bout to Churchill!", "If a bullet to the chest won't stop you, my words will", "A bullet can't stop the Bull Moose!", "TR will give WC the full deuce!", "Whatever shit you throw at me, I'll just return to sender!", "I'll battle to the end and I will never surrender!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "85": ["Action", "(What you say?)", "Yo, it was five o'clock and I was making a Nesspresso", "I was thinking to myself you know, there's fans that want some special extra shit", "That can't be seen by everybody that subscribes", "I'm talking 'bout the fans who kept the rap battles alive", "And I was sitting at the coffee table cutting checks for rent", "And all the other bills we got since we went independent", "And I was like, damn, I'm so glad we did this", "But damn, we gotta run this whole business", "Yo Lloyd, check it out man, the mask came in", "Sweet", "Well this is the stunt mask, the other one is coming next week", "What?", "It's so easy, we got a sweat deal, see?", "We'll keep the whole costume under three G's, easy", "Three G's", "Easy", "Yo this isn't cool", "Hey, this is very cool", "We still owe five to Atul", "True", "Speaking of that, I think we should do the makeup", "'Cause it would be cool to have a scar when you wake up", "We need some extra funds", "I think we need some extra minds", "I just wanna get this done", "We've got so much to decide", "Like should the Red Baron really actually fly?", "Dude", "What man? you decide", "Pete, man, I'm with you; we gotta do this right", "But we can't spend all the cash, we need to rent some lights", "Man, you gotta see these Wendy's comments, this dude can write", "If he could know the battles in advance, that would be tight", "I've got an idea (I've got an idea)", "We should start a Patreon", "We'll start a Patreon", "We'll start a Patreon", "We got a Patreon", "Yo, in the George Carlin verse, I wanna say shit, fuck and jism", "And I'm not tryna bow to no ads or algorithms", "Patreon", "We'll start a Patreon", "We got a Patreon", "We got a Patreon", "We'll have a special Discord where you can help us make decisions", "And live stream sessions where we answer all your questions", "Patreon", "We got a Patreon", "We got a Patreon", "We got a Patreon", "Patreon"], "86": ["TONY HAWK!", "VERSUS!", "WAYNE GRETZKY!", "BEGIN!", "I can skate better than this church boy turd can", "Not Cash Money, it's just Wayne versus Birdman", "You got your whole league to protect and adore you", "So which goon's gonna take this battle for you?", "I'm the dude who blew up extreme sports", "That nose looks like it's seen extreme snorts", "I mean, look at that thing, that slope is gigantic", "Even I wouldn't fly off a ramp that titanic", "And all the ice underneath you will be melted into water", "When I hit you with a trick that's even hotter than your daughter", "You're old and you're basic, your talent is faded", "And Oiler alert: you're about to get traded", "I drop rhymes like I'm dropping into a half pipe", "I'll thrash this asswipe, hit you like a hash pipe", "Keep your mittens on, Gretzky, you're too clean", "I got this covered like gravy on poutine", "That verse was rough; damn, Tony", "So let me smooth it out, like I'm a damn Zamboni", "I'm the greatest ever when I play hockey", "But on the microphone I don't play, Hawkey", "This is a street fight, T-Hawk, show some respect", "If you don't, then you'll catch a slap shot to the deck", "And I take a Flyer down, bird, you're getting wrecked", "So you best prepare for arrival and cross check", "Hey, let me tell you what putting a puck in the net's worth", "Double what you bank in bucks, check my net worth", "And my hot wife, the only woman in the world for Wayne", "You're on your fourth wife, talk about the X-Games", "There was one big trick that you ever did", "Then you got out-spun by a 12-year old kid", "Oh, you like finger flips? How 'bout one of these?", "Sit on this and rotate 900 degrees", "Great one, Wayne; let me say something, Wayne", "I got 99 problems and you ain't one Wayne", "You'll catch a pop-shove it to the mullet if you tempt me", "Your threats are like my swimming pools, bruh, empty", "Let's skip the kickflips and McTwists", "You'll be speechless after three periods like an ellipsis", "This goofy-footed geek straight getting smoked", "Got you down on your kneepads, sorry bout the deke joke", "You should hit the buzzer 'cause it's time to change lines", "You put that joke in a top shelf of lame rhymes", "This ain't typical sports, I use centripetal force", "While you prance around in four-pound icy diaper shorts", "I try to watch you on TV, but I can't see the puck", "Hockey used to have guts, but now the teams mighty suck", "I taught kids around the world that there's nothing they can't do", "Put more souls into skating than some Vans shoes", "Time out; let's talk about athletic achievements", "You and I have so many world records between us", "184, that's plenty of them", "And I set 183 of them!", "Undisputed, unrefuted G-O-A-T", "You've been going downhill since Pro Skater 3", "And I'm too far ahead for you to catch up", "For true sports fans, this was finished as soon they heard the match up", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!"], "87": ["*howl*", "COUNT DRACULA!", "VERSUS!", "VLAD THE IMPALER!", "BEGIN!", "Imagine forests of corpses, dripping on a buffet", "You call that a nightmare? I call that a Tuesday", "Vlad Dracula, spawn of the devil", "Dipping my bread in your weeping blood vessels", "Scorched the earth from Hungary to Wallachia", "I inspire fear, you inspire Count Chocula", "Step to the Turks and the bodies started dropping", "Put my foot on Ottomans like I was furniture shopping", "I save my stakes, no need crucifix", "I kill you with Olive Garden garlic breadsticks", "I butcher men, women, and children like cows", "Put more meat on swords than Fogo de Chão!", "Does this mic still work after that blah, blah, blah?", "Check one... two... ah, ah, ah!", "The flex of a rear-spearing princeling, can’t vex me", "‘Cause I nibble necks and I make it look sexy", "I’m Universally known for intrigue and desire", "I shapeshift into mist and bone Winona Ryder", "Slick hair, popped collar, and a damn nice cape", "While you’ve got less taste than an Anne Rice cake", "Your rhymes are empty, like I leave vascular systems", "I’d grant you the privilege of being Dracula’s victim", "But the thought of biting you makes me get nauseous", "You don’t look like the type that's keen on neck washes!", "Did you shapeshift those punchlines? ‘Cause they mist", "Your skill’s like your reflection: it doesn’t exist!", "Turn your taint to a 'tis, when I put a stick through ya", "Haven’t seen a sucker this soft, since Bunnicula", "Get beat by Count Dracula? You’re smoking crackula", "I dunk on your wackula raps like I’m Shaqula (Oh!)", "I’m Vlad to the bone, Vlad the hat-nailer", "Vlad that commits heinous acts on rats, ask the jailer", "You leeched my name, you pale son of a bitch", "And your weak ass gets beat by the sun at the beach", "Your slick hair and cape are all flappy razzle-dazzle", "But at end of day you’re a bat, and that’s only half a battle", "Wow! I did not know that you could read", "That’s great... now let’s see if you can bleed! (Hiss!)", "Ha! You thought the sun could kill me? Not true!", "I’m the vampire so cold they call me Nosfer-achoo!", "My syllable delivery is devilishly intricate", "I rock the house, once I’m invited into it", "And here’s a tidbit, that you can stick a stake up:", "You’re losing so bad you should join Team Jacob", "Renfield!", "Yes master?", "Call a doctor, not Seward (ugh!)", "Cause Vlad the Impaler has just been skewered", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC-", "AAAAA, AAA AA AA AAAAHAA", "RAP BATTLES OF HISTORY!"], "88": ["Work hard, keep your head in the game", "And if someone gets in your way", "And if someone gets in your way", "Tell them you don't give a damn! (Don't give a damn)", "Work hard, keep your head in the game", "And if someone gets in your way", "And if someone gets in your way", "Tell them you don't give a damn! (Don't give a damn)", "(Epic Rap Battles, Epic Rap Battles, Epic Rap Battles)", "(Epic Rap Battles, Epic Rap Battles, Epic Rap Battles)", "(Whats up bitches)", "Whats up bitches!", "Bitches!", "We did it because of you", "Your suggestions and support got us through the woods", "I know it sucks balls to wait", "But sometimes it just takes a long time to make them right", "(it just takes a long time to make them right)", "Because we don't want to make them suck balls", "Work hard, keep your head in the game", "And if someone gets in your way", "And if someone gets in your way", "Tell them you don't give a damn! (Don't give a damn)", "Work hard (Work hard), keep your head in the game (keep your head in the game)", "And if someone gets in your way (And if someone gets in your way)", "And if someone gets in your way (And if someone gets in your way)", "Tell them you don't give a damn!", "(Don't)", "(Epic Rap Battles, Epic Rap Battles, Epic Rap Battles)", "(Epic Rap Battles, Epic Rap Battles, Epic Rap Battles)", "(Whats up bitches)", "Whats up bitches!"], "89": ["WONDER WOMAN!", "VERSUS!", "STEVIE WONDER!", "BEGIN!", "Wonder Woman fly, I'm about to tell you why", "Princess Diana, but this Lady don't die", "My rhymes are signed, sealed, and delivered on time", "You're a bald has-been, I'm in my Amazon Prime (Ha!)", "I tell you what I say, you bit your style from Ray!", "The grin and the shades and the king cobra head sway", "Gods made me out of clay, then they broke the mold", "I'm like Geena Davis, in a Justice League of my Own (Ow!)", "I Just Called to Say that you need to ditch the hair beads", "Lookin' like the Predator after some chemotherapy (Ha!)", "But don't be scared, I let bats down easy", "So you don't gotta worry 'bout a thing, little Stevie", "I feel like this is the beginning (Ohhh...)", "But you have sucked for a few thousand years", "I'm a man who comes from a higher ground (Whoo!)", "And I'd say DC is a whole step down", "I've been spitting out hits since both Fingertips", "So use the tip of your fingers and read my lips", "Now how you gonna talk about a bat being blind?", "You need to echo-relocate to the 4th of July", "Because you're Miss Independent, or at least you try", "But your first story is you running off with a guy", "Now let me tell the truth 'cause I know you got the lasso", "You got that wack flow, Sufferin' Sappho!", "I'm the ceremony master, blaster with the bars", "And I got more Grammys than your panties got stars", "Well, I'm a Woman who wonders what you're thinking", "Some of your records make me wish you started drinking", "Even if I stick to the best selections", "Your YouTube videos raise some vision questions", "Your ignorant questions could never cause as much pain", "As never knowing how stupid you look in your airplane", "You're a misguided, C-minus-on-the-Bechdel-Test joke", "And my worst song is better than your best TV show", "Look, I don't wanna judge a Talking Book by its cover", "But of the vegan buffet, you're a Full Time Lover", "And a part-time father, from what I've discovered", "Nine different kids with five different mothers", "You couldn't walk in my shoes, so stick to your reboots", "With plots so thin even I could see through", "It's not a superstition, I believe you got dissed", "Not even your tiara's coming back from this! (Yeah!) Haha!", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC (harmonica sound) RAP BATTLES OF HISTORY!", "(Yeah...Yeah...)"], "90": ["ZEUS!", "VS!", "THOR!", "BEGIN!", "How dare you challenge my immortal throne?", "I'm the father of the gods, put your daddy on the phone", "Maybe Odin could beg me for a truce, cause when Zeus lets loose", "I'll put your cross-dressing neck in a noose", "I'm like Medusa, I'll stone a motherfucker if he looks at me wrong", "I'm a bull, getting bitches with my swan schlong", "I'm on point like Poseidon's trident", "Rhymes colder than the frosty balls of your giants", "Allow Thor to retort, you shape-shifting rapist", "And get a taste of this Scandinavian greatness", "Brought forth by my raging thunderstorm force", "Cause I don't get nice, I get Norse (Noirse!)", "Valhalla-atcha boy and we'll flyte it out", "But keep your Asgard up, I Ragnarök the house", "You tongue kiss your sister, that's grosser than a Gorgon", "I'm the thunder down under, nailing Natalie Portman", "Who would ever worship someone as abusive as Zeus is?", "You're ruthless to humans, your crew is like the Clash of the Douches", "Ruling over the Greeks, a people weak and frightened", "I'd spit in your face but you'd probably like it", "Only a mindless fool would knock the fathers of philosophy", "My Greeks built the bedrock of democracy", "With astronomy, they charted out the movements of my kin", "All the pimps on Mount Olympus and me the kingpin", "Let this sink in, I'm about to rain on your parade", "Itchy trigger finger quicker with the bolts than Usain", "You're history, I'll be the first to put it in writing", "MC Hammer just got struck twice by greased lightning", "Rain, old man? This is hardly a drizzle", "You couldn't give the women in my homeland the sniffles", "You can keep your astronomers, I'll sail with the conquerors", "For thousands of kilometers, discovering the continents", "I'm alpha dog dominant, you can't beat me", "I will drop you like Greece's GDP", "Send you deeper underground than the depths of your Hades", "Now make like your daddy, and swallow my babies", "You think the underworld scares the ruler of the skies?", "You're joking, Loki must have written your lines", "By the time I've finished whipping you with wits and rhymes", "You'll need a lighter for your ship, cause a viking just died", "Your glory days are over, The Oracle shoulda told'ya", "I'll kick your wrinkly dick back in your toga like \"opa\"", "Here, take these drachma for your eyes", "When you get to River Styx, tell your three headed bitch I say hi (woof!)", "WHO WON?", "WHO'S NEXT?", "YOU DECIDE!", "EPIC...RAP BATTLES OF HISTORY!"], "91": ["ZEUS!", "VERSUS!", "THOR!", "BEGIN!", "Thor:", "You've never been at war with the likes of Thor before", "The oracle shoulda warned you about the blood and gore", "Brought forth my raging thunderstorm force", "Because I don't get nice, I get Norse! (Norse!)", "Valhalla at ya boy and we'll flyte it out", "But keep your Asgard up, I Ragnarok the house!", "You tongue kissed your sister and consort with gorgons?", "Im the thunder down under nailing Natalie Portman!", "Who would ever worship someone as abusive as Zeus is?", "You're ruthless to humans, im pooching on this God of the Douches", "And when we're through with this your Hubris will send you to Hades", "So make like your daddy, and swallow my babies", "Zeus:", "Im the father of the Gods, Barbie, mind your manners!", "Odin can't touch this, let alone MC Hammer!", "I'll flip more middle fingers at you than a hundred hander", "Take your little tool away and you're just a blonde Bruce Banner!", "Im Olympic gold standard, on point like a trident", "Drop science colder than the frosty balls of your giants!", "Poseidon couldn't fathom the depth of your thickness", "I bask in the sun and you chose the land of Christmas", "\"But i have to save the mortals!\" Ech, blow me!", "I'll be boozing on the ouzo at the beach with Loki!", "There's a hundred percent chance in the weather forecast", "Of Zeus raining wrath down upon Thor's ass!", "Thor:", "Rain old man? This is hardly a drizzle", "You couldn't give the women in my homeland the sniffles", "You look miserable, old, and fat", "And you groped so many mates, you surely have the thunderclap!", "It's the swan song for your bullshit, with Leda and Europa!", "You shape-shifting rapist, keep your dick inside your toga!", "It's over, I'll smash you like an ogre!", "Thor's a mighty soldier, you're a poor carbon copy, only older", "Zeus:", "You call yourself mighty, but you're not to my liking!", "So i'll strike this weak viking twice with greased lightning!", "This blond shit talker is soft as Betty Crocker!", "I scarred Harry Potter, gave Ben Franklin the shocker‏!", "I am the alpha and the O, mega!", "You're Thor skinned dick cheddar, smegma!", "Conquer the cloud-cold Nectar? Never!", "Without the Avengers, you would never be remembered!"]}